Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,933,439
Trainable params: 10,933,439
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0274, Training ACC= 0.4078, Validation cost= 0.9572, Validation ACC= 0.4591 (......)
Epoch     2: Training cost= 0.9445, Training ACC= 0.4833, Validation cost= 0.9205, Validation ACC= 0.5001 (......)
Epoch     3: Training cost= 0.9082, Training ACC= 0.5127, Validation cost= 0.9155, Validation ACC= 0.5224 (......)
Epoch     4: Training cost= 0.8813, Training ACC= 0.5307, Validation cost= 0.9082, Validation ACC= 0.5375 (......)
Epoch     5: Training cost= 0.8577, Training ACC= 0.5438, Validation cost= 0.9015, Validation ACC= 0.5492 (......)
Epoch     6: Training cost= 0.8366, Training ACC= 0.5545, Validation cost= 0.9061, Validation ACC= 0.5590 (......)
Epoch     7: Training cost= 0.8157, Training ACC= 0.5637, Validation cost= 0.9074, Validation ACC= 0.5677 (......)
Epoch     8: Training cost= 0.7955, Training ACC= 0.5720, Validation cost= 0.9186, Validation ACC= 0.5758 (......)
Epoch     9: Training cost= 0.7763, Training ACC= 0.5797, Validation cost= 0.9344, Validation ACC= 0.5831 (......)
Epoch    10: Training cost= 0.7603, Training ACC= 0.5867, Validation cost= 0.9393, Validation ACC= 0.5899 (0.9209)
Epoch    11: Training cost= 0.7452, Training ACC= 0.5932, Validation cost= 0.9952, Validation ACC= 0.5962 (0.9247)
Epoch    12: Training cost= 0.7304, Training ACC= 0.5993, Validation cost= 0.9596, Validation ACC= 0.6020 (0.9286)
Epoch    13: Training cost= 0.7171, Training ACC= 0.6050, Validation cost= 1.0022, Validation ACC= 0.6075 (0.9373)
Epoch    14: Training cost= 0.7042, Training ACC= 0.6102, Validation cost= 1.0080, Validation ACC= 0.6127 (0.9472)
Epoch    15: Training cost= 0.6937, Training ACC= 0.6153, Validation cost= 1.0380, Validation ACC= 0.6176 (0.9609)
MNLI-m relation 256 10933439 320.7734 21.3849
