Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,117,639
Trainable params: 11,117,639
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0266, Training ACC= 0.4077, Validation cost= 0.9456, Validation ACC= 0.4602 (......)
Epoch     2: Training cost= 0.9434, Training ACC= 0.4847, Validation cost= 0.9230, Validation ACC= 0.5013 (......)
Epoch     3: Training cost= 0.9062, Training ACC= 0.5140, Validation cost= 0.9056, Validation ACC= 0.5237 (......)
Epoch     4: Training cost= 0.8792, Training ACC= 0.5322, Validation cost= 0.8994, Validation ACC= 0.5391 (......)
Epoch     5: Training cost= 0.8538, Training ACC= 0.5458, Validation cost= 0.9001, Validation ACC= 0.5513 (......)
Epoch     6: Training cost= 0.8302, Training ACC= 0.5570, Validation cost= 0.9018, Validation ACC= 0.5619 (......)
Epoch     7: Training cost= 0.8076, Training ACC= 0.5669, Validation cost= 0.9115, Validation ACC= 0.5712 (......)
Epoch     8: Training cost= 0.7872, Training ACC= 0.5757, Validation cost= 0.9102, Validation ACC= 0.5795 (......)
Epoch     9: Training cost= 0.7694, Training ACC= 0.5836, Validation cost= 0.9220, Validation ACC= 0.5872 (......)
Epoch    10: Training cost= 0.7512, Training ACC= 0.5910, Validation cost= 0.9409, Validation ACC= 0.5942 (0.9160)
Epoch    11: Training cost= 0.7355, Training ACC= 0.5976, Validation cost= 0.9684, Validation ACC= 0.6006 (0.9183)
Epoch    12: Training cost= 0.7212, Training ACC= 0.6038, Validation cost= 0.9663, Validation ACC= 0.6066 (0.9226)
Epoch    13: Training cost= 0.7071, Training ACC= 0.6096, Validation cost= 0.9679, Validation ACC= 0.6122 (0.9288)
Epoch    14: Training cost= 0.6957, Training ACC= 0.6149, Validation cost= 0.9931, Validation ACC= 0.6174 (0.9382)
Epoch    15: Training cost= 0.6843, Training ACC= 0.6199, Validation cost= 1.0057, Validation ACC= 0.6222 (0.9488)
MNLI-mm relation 256 11117639 315.8870 21.0591
