Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,192,182
Trainable params: 11,192,182
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6749, Training ACC= 0.5466, Validation cost= 0.6544, Validation ACC= 0.5750 (......)
Epoch     2: Training cost= 0.6536, Training ACC= 0.5862, Validation cost= 0.6519, Validation ACC= 0.5940 (......)
Epoch     3: Training cost= 0.6366, Training ACC= 0.6007, Validation cost= 0.6481, Validation ACC= 0.6062 (......)
Epoch     4: Training cost= 0.6104, Training ACC= 0.6123, Validation cost= 0.6444, Validation ACC= 0.6173 (......)
Epoch     5: Training cost= 0.5801, Training ACC= 0.6233, Validation cost= 0.6558, Validation ACC= 0.6284 (......)
Epoch     6: Training cost= 0.5475, Training ACC= 0.6341, Validation cost= 0.6777, Validation ACC= 0.6388 (......)
Epoch     7: Training cost= 0.5184, Training ACC= 0.6442, Validation cost= 0.6846, Validation ACC= 0.6484 (......)
Epoch     8: Training cost= 0.4900, Training ACC= 0.6532, Validation cost= 0.8037, Validation ACC= 0.6572 (......)
Epoch     9: Training cost= 0.4652, Training ACC= 0.6616, Validation cost= 0.8122, Validation ACC= 0.6652 (......)
Epoch    10: Training cost= 0.4438, Training ACC= 0.6693, Validation cost= 0.9508, Validation ACC= 0.6728 (0.7184)
Epoch    11: Training cost= 0.4221, Training ACC= 0.6767, Validation cost= 1.0255, Validation ACC= 0.6801 (0.7555)
Epoch    12: Training cost= 0.4037, Training ACC= 0.6839, Validation cost= 1.2413, Validation ACC= 0.6872 (0.8144)
Epoch    13: Training cost= 0.3840, Training ACC= 0.6909, Validation cost= 1.4260, Validation ACC= 0.6941 (0.8922)
Epoch    14: Training cost= 0.3652, Training ACC= 0.6977, Validation cost= 1.2722, Validation ACC= 0.7009 (0.9550)
Epoch    15: Training cost= 0.3499, Training ACC= 0.7044, Validation cost= 1.5724, Validation ACC= 0.7075 (1.0466)
QNLI relation 256 11192182 87.3034 5.8202
