Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,724,882
Trainable params: 21,724,882
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5504, Training ACC= 0.6867, Validation cost= 0.5065, Validation ACC= 0.7219 (......)
Epoch     2: Training cost= 0.4857, Training ACC= 0.7349, Validation cost= 0.4895, Validation ACC= 0.7433 (......)
Epoch     3: Training cost= 0.4565, Training ACC= 0.7500, Validation cost= 0.4766, Validation ACC= 0.7554 (......)
Epoch     4: Training cost= 0.4353, Training ACC= 0.7601, Validation cost= 0.4712, Validation ACC= 0.7638 (......)
Epoch     5: Training cost= 0.4168, Training ACC= 0.7674, Validation cost= 0.4736, Validation ACC= 0.7704 (......)
Epoch     6: Training cost= 0.4021, Training ACC= 0.7734, Validation cost= 0.4912, Validation ACC= 0.7757 (......)
Epoch     7: Training cost= 0.3893, Training ACC= 0.7782, Validation cost= 0.4970, Validation ACC= 0.7802 (......)
Epoch     8: Training cost= 0.3766, Training ACC= 0.7823, Validation cost= 0.5013, Validation ACC= 0.7841 (......)
Epoch     9: Training cost= 0.3661, Training ACC= 0.7861, Validation cost= 0.5454, Validation ACC= 0.7878 (......)
Epoch    10: Training cost= 0.3556, Training ACC= 0.7896, Validation cost= 0.5386, Validation ACC= 0.7912 (0.4991)
Epoch    11: Training cost= 0.3465, Training ACC= 0.7928, Validation cost= 0.5991, Validation ACC= 0.7942 (0.5083)
Epoch    12: Training cost= 0.3391, Training ACC= 0.7958, Validation cost= 0.6089, Validation ACC= 0.7971 (0.5203)
Epoch    13: Training cost= 0.3318, Training ACC= 0.7985, Validation cost= 0.6324, Validation ACC= 0.7998 (0.5359)
Epoch    14: Training cost= 0.3252, Training ACC= 0.8011, Validation cost= 0.8652, Validation ACC= 0.8023 (0.5753)
Epoch    15: Training cost= 0.3187, Training ACC= 0.8035, Validation cost= 0.8444, Validation ACC= 0.8047 (0.6123)
QQP relation 256 21724882 292.1925 19.4795
