Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  2801300   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 3,116,182
Trainable params: 3,116,182
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.7034, Training ACC= 0.4937, Validation cost= 0.6940, Validation ACC= 0.4914 (......)
Epoch     2: Training cost= 0.6978, Training ACC= 0.4933, Validation cost= 0.6926, Validation ACC= 0.4926 (......)
Epoch     3: Training cost= 0.6937, Training ACC= 0.4989, Validation cost= 0.6925, Validation ACC= 0.5034 (......)
Epoch     4: Training cost= 0.6938, Training ACC= 0.5069, Validation cost= 0.6920, Validation ACC= 0.5093 (......)
Epoch     5: Training cost= 0.6918, Training ACC= 0.5104, Validation cost= 0.6919, Validation ACC= 0.5130 (......)
Epoch     6: Training cost= 0.6943, Training ACC= 0.5126, Validation cost= 0.6914, Validation ACC= 0.5125 (......)
Epoch     7: Training cost= 0.6948, Training ACC= 0.5121, Validation cost= 0.6922, Validation ACC= 0.5118 (......)
Epoch     8: Training cost= 0.6897, Training ACC= 0.5140, Validation cost= 0.6926, Validation ACC= 0.5152 (......)
Epoch     9: Training cost= 0.6880, Training ACC= 0.5170, Validation cost= 0.6906, Validation ACC= 0.5185 (......)
Epoch    10: Training cost= 0.6886, Training ACC= 0.5196, Validation cost= 0.6898, Validation ACC= 0.5205 (0.6920)
Epoch    11: Training cost= 0.6849, Training ACC= 0.5221, Validation cost= 0.6954, Validation ACC= 0.5233 (0.6921)
Epoch    12: Training cost= 0.6817, Training ACC= 0.5251, Validation cost= 0.6930, Validation ACC= 0.5264 (0.6921)
Epoch    13: Training cost= 0.6794, Training ACC= 0.5280, Validation cost= 0.6926, Validation ACC= 0.5294 (0.6922)
Epoch    14: Training cost= 0.6720, Training ACC= 0.5310, Validation cost= 0.7006, Validation ACC= 0.5321 (0.6930)
Epoch    15: Training cost= 0.6582, Training ACC= 0.5346, Validation cost= 0.7032, Validation ACC= 0.5368 (0.6941)
RTE relation 256 3116182 2.6171 0.1745
