Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,005,090
Trainable params: 2,005,090
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.4873, Training ACC= 0.6751, Validation cost= 0.4282, Validation ACC= 0.7566 (......)
Epoch     2: Training cost= 0.3084, Training ACC= 0.7914, Validation cost= 0.4324, Validation ACC= 0.8158 (......)
Epoch     3: Training cost= 0.2412, Training ACC= 0.8325, Validation cost= 0.4169, Validation ACC= 0.8456 (......)
Epoch     4: Training cost= 0.2036, Training ACC= 0.8559, Validation cost= 0.4341, Validation ACC= 0.8643 (......)
Epoch     5: Training cost= 0.1772, Training ACC= 0.8715, Validation cost= 0.5206, Validation ACC= 0.8776 (......)
Epoch     6: Training cost= 0.1596, Training ACC= 0.8831, Validation cost= 0.5270, Validation ACC= 0.8875 (......)
Epoch     7: Training cost= 0.1469, Training ACC= 0.8918, Validation cost= 0.5351, Validation ACC= 0.8954 (......)
Epoch     8: Training cost= 0.1387, Training ACC= 0.8987, Validation cost= 0.5817, Validation ACC= 0.9015 (......)
Epoch     9: Training cost= 0.1270, Training ACC= 0.9043, Validation cost= 0.5542, Validation ACC= 0.9068 (......)
Epoch    10: Training cost= 0.1175, Training ACC= 0.9093, Validation cost= 0.5557, Validation ACC= 0.9114 (0.4986)
Epoch    11: Training cost= 0.1135, Training ACC= 0.9135, Validation cost= 0.6215, Validation ACC= 0.9153 (0.5179)
Epoch    12: Training cost= 0.1047, Training ACC= 0.9172, Validation cost= 0.6095, Validation ACC= 0.9187 (0.5356)
Epoch    13: Training cost= 0.1011, Training ACC= 0.9204, Validation cost= 0.6133, Validation ACC= 0.9218 (0.5553)
Epoch    14: Training cost= 0.0930, Training ACC= 0.9232, Validation cost= 0.7401, Validation ACC= 0.9245 (0.5859)
Epoch    15: Training cost= 0.0878, Training ACC= 0.9259, Validation cost= 0.8077, Validation ACC= 0.9271 (0.6146)
SST-2 relation 256 2005090 11.1650 0.7443
