Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,909,046
Trainable params: 10,909,046
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6896, Training ACC= 0.5196, Validation cost= 0.6784, Validation ACC= 0.5395 (......)
Epoch     2: Training cost= 0.6743, Training ACC= 0.5530, Validation cost= 0.6660, Validation ACC= 0.5631 (......)
Epoch     3: Training cost= 0.6638, Training ACC= 0.5702, Validation cost= 0.6584, Validation ACC= 0.5760 (......)
Epoch     4: Training cost= 0.6516, Training ACC= 0.5815, Validation cost= 0.6577, Validation ACC= 0.5861 (......)
Epoch     5: Training cost= 0.6348, Training ACC= 0.5916, Validation cost= 0.6555, Validation ACC= 0.5964 (......)
Epoch     6: Training cost= 0.6191, Training ACC= 0.6012, Validation cost= 0.6665, Validation ACC= 0.6053 (......)
Epoch     7: Training cost= 0.5999, Training ACC= 0.6104, Validation cost= 0.6655, Validation ACC= 0.6146 (......)
Epoch     8: Training cost= 0.5805, Training ACC= 0.6196, Validation cost= 0.6749, Validation ACC= 0.6239 (......)
Epoch     9: Training cost= 0.5614, Training ACC= 0.6287, Validation cost= 0.6827, Validation ACC= 0.6327 (......)
Epoch    10: Training cost= 0.5429, Training ACC= 0.6373, Validation cost= 0.6988, Validation ACC= 0.6412 (0.6704)
Epoch    11: Training cost= 0.5264, Training ACC= 0.6453, Validation cost= 0.7028, Validation ACC= 0.6489 (0.6729)
Epoch    12: Training cost= 0.5125, Training ACC= 0.6529, Validation cost= 0.7146, Validation ACC= 0.6562 (0.6777)
Epoch    13: Training cost= 0.4997, Training ACC= 0.6597, Validation cost= 0.7374, Validation ACC= 0.6628 (0.6856)
Epoch    14: Training cost= 0.4879, Training ACC= 0.6661, Validation cost= 0.7436, Validation ACC= 0.6690 (0.6942)
Epoch    15: Training cost= 0.4746, Training ACC= 0.6720, Validation cost= 0.7702, Validation ACC= 0.6747 (0.7057)
QNLI normal 64 10909046 64.2790 4.2853
