Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  2801300   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,833,046
Trainable params: 2,833,046
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.7117, Training ACC= 0.5056, Validation cost= 0.6933, Validation ACC= 0.4984 (......)
Epoch     2: Training cost= 0.6979, Training ACC= 0.5028, Validation cost= 0.6930, Validation ACC= 0.4992 (......)
Epoch     3: Training cost= 0.6964, Training ACC= 0.5039, Validation cost= 0.6931, Validation ACC= 0.5016 (......)
Epoch     4: Training cost= 0.6952, Training ACC= 0.4997, Validation cost= 0.6933, Validation ACC= 0.4993 (......)
Epoch     5: Training cost= 0.6932, Training ACC= 0.5023, Validation cost= 0.6933, Validation ACC= 0.5030 (......)
Epoch     6: Training cost= 0.6940, Training ACC= 0.5014, Validation cost= 0.6932, Validation ACC= 0.5011 (......)
Epoch     7: Training cost= 0.6938, Training ACC= 0.5003, Validation cost= 0.6931, Validation ACC= 0.5005 (......)
Epoch     8: Training cost= 0.6925, Training ACC= 0.5013, Validation cost= 0.6932, Validation ACC= 0.5018 (......)
Epoch     9: Training cost= 0.6934, Training ACC= 0.5011, Validation cost= 0.6935, Validation ACC= 0.5003 (......)
Epoch    10: Training cost= 0.6924, Training ACC= 0.5006, Validation cost= 0.6935, Validation ACC= 0.5006 (0.6933)
Epoch    11: Training cost= 0.6927, Training ACC= 0.5007, Validation cost= 0.6935, Validation ACC= 0.5007 (0.6933)
Epoch    12: Training cost= 0.6937, Training ACC= 0.5011, Validation cost= 0.6933, Validation ACC= 0.5012 (0.6933)
Epoch    13: Training cost= 0.6928, Training ACC= 0.5015, Validation cost= 0.6928, Validation ACC= 0.5018 (0.6933)
Epoch    14: Training cost= 0.6930, Training ACC= 0.5020, Validation cost= 0.6931, Validation ACC= 0.5027 (0.6933)
Epoch    15: Training cost= 0.6922, Training ACC= 0.5034, Validation cost= 0.6933, Validation ACC= 0.5034 (0.6933)
RTE normal 64 2833046 1.9594 0.1306
