Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,783,586
Trainable params: 1,783,586
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5961, Training ACC= 0.6018, Validation cost= 0.4863, Validation ACC= 0.6583 (......)
Epoch     2: Training cost= 0.4718, Training ACC= 0.6883, Validation cost= 0.4746, Validation ACC= 0.7129 (......)
Epoch     3: Training cost= 0.4116, Training ACC= 0.7318, Validation cost= 0.4663, Validation ACC= 0.7467 (......)
Epoch     4: Training cost= 0.3746, Training ACC= 0.7587, Validation cost= 0.4696, Validation ACC= 0.7689 (......)
Epoch     5: Training cost= 0.3452, Training ACC= 0.7775, Validation cost= 0.5114, Validation ACC= 0.7848 (......)
Epoch     6: Training cost= 0.3276, Training ACC= 0.7914, Validation cost= 0.5284, Validation ACC= 0.7970 (......)
Epoch     7: Training cost= 0.3139, Training ACC= 0.8020, Validation cost= 0.5561, Validation ACC= 0.8064 (......)
Epoch     8: Training cost= 0.3036, Training ACC= 0.8105, Validation cost= 0.5640, Validation ACC= 0.8140 (......)
Epoch     9: Training cost= 0.2953, Training ACC= 0.8174, Validation cost= 0.5709, Validation ACC= 0.8204 (......)
Epoch    10: Training cost= 0.2883, Training ACC= 0.8231, Validation cost= 0.5742, Validation ACC= 0.8256 (0.5202)
Epoch    11: Training cost= 0.2807, Training ACC= 0.8281, Validation cost= 0.6163, Validation ACC= 0.8303 (0.5332)
Epoch    12: Training cost= 0.2729, Training ACC= 0.8325, Validation cost= 0.6482, Validation ACC= 0.8345 (0.5505)
Epoch    13: Training cost= 0.2717, Training ACC= 0.8363, Validation cost= 0.6775, Validation ACC= 0.8378 (0.5717)
Epoch    14: Training cost= 0.2640, Training ACC= 0.8395, Validation cost= 0.6669, Validation ACC= 0.8411 (0.5914)
Epoch    15: Training cost= 0.2607, Training ACC= 0.8427, Validation cost= 0.7192, Validation ACC= 0.8441 (0.6122)
SST-2 normal 64 1783586 6.9932 0.4662
