Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  171600    
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 199,186
Trainable params: 199,186
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.7526, Training ACC= 0.4527, Validation cost= 0.6925, Validation ACC= 0.4664 (......)
Epoch     2: Training cost= 0.7171, Training ACC= 0.4655, Validation cost= 0.6964, Validation ACC= 0.4703 (......)
Epoch     3: Training cost= 0.7051, Training ACC= 0.4742, Validation cost= 0.6951, Validation ACC= 0.4804 (......)
Epoch     4: Training cost= 0.7040, Training ACC= 0.4846, Validation cost= 0.6954, Validation ACC= 0.4871 (......)
Epoch     5: Training cost= 0.7013, Training ACC= 0.4884, Validation cost= 0.6952, Validation ACC= 0.4911 (......)
Epoch     6: Training cost= 0.6986, Training ACC= 0.4902, Validation cost= 0.6949, Validation ACC= 0.4911 (......)
Epoch     7: Training cost= 0.6970, Training ACC= 0.4931, Validation cost= 0.6939, Validation ACC= 0.4950 (......)
Epoch     8: Training cost= 0.7013, Training ACC= 0.4938, Validation cost= 0.6968, Validation ACC= 0.4922 (......)
Epoch     9: Training cost= 0.6941, Training ACC= 0.4917, Validation cost= 0.6947, Validation ACC= 0.4928 (......)
Epoch    10: Training cost= 0.6944, Training ACC= 0.4944, Validation cost= 0.6963, Validation ACC= 0.4951 (0.6951)
Epoch    11: Training cost= 0.6965, Training ACC= 0.4954, Validation cost= 0.6971, Validation ACC= 0.4955 (0.6956)
Epoch    12: Training cost= 0.6990, Training ACC= 0.4944, Validation cost= 0.6970, Validation ACC= 0.4936 (0.6956)
Epoch    13: Training cost= 0.6932, Training ACC= 0.4936, Validation cost= 0.6964, Validation ACC= 0.4944 (0.6958)
Epoch    14: Training cost= 0.6963, Training ACC= 0.4945, Validation cost= 0.6946, Validation ACC= 0.4953 (0.6957)
Epoch    15: Training cost= 0.6951, Training ACC= 0.4956, Validation cost= 0.6945, Validation ACC= 0.4970 (0.6956)
WNLI normal 64 199186 1.0271 0.0685
