Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,077,191
Trainable params: 11,077,191
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0336, Training ACC= 0.4158, Validation cost= 0.9642, Validation ACC= 0.4552 (......)
Epoch     2: Training cost= 0.9863, Training ACC= 0.4690, Validation cost= 0.9389, Validation ACC= 0.4787 (......)
Epoch     3: Training cost= 0.9675, Training ACC= 0.4858, Validation cost= 0.9399, Validation ACC= 0.4912 (......)
Epoch     4: Training cost= 0.9529, Training ACC= 0.4961, Validation cost= 0.9339, Validation ACC= 0.5003 (......)
Epoch     5: Training cost= 0.9413, Training ACC= 0.5043, Validation cost= 0.9349, Validation ACC= 0.5075 (......)
Epoch     6: Training cost= 0.9310, Training ACC= 0.5108, Validation cost= 0.9382, Validation ACC= 0.5137 (......)
Epoch     7: Training cost= 0.9238, Training ACC= 0.5163, Validation cost= 0.9373, Validation ACC= 0.5186 (......)
Epoch     8: Training cost= 0.9143, Training ACC= 0.5212, Validation cost= 0.9375, Validation ACC= 0.5233 (......)
Epoch     9: Training cost= 0.9074, Training ACC= 0.5254, Validation cost= 0.9450, Validation ACC= 0.5272 (......)
Epoch    10: Training cost= 0.9005, Training ACC= 0.5293, Validation cost= 0.9433, Validation ACC= 0.5309 (0.9413)
Epoch    11: Training cost= 0.8935, Training ACC= 0.5327, Validation cost= 0.9399, Validation ACC= 0.5342 (0.9389)
Epoch    12: Training cost= 0.8871, Training ACC= 0.5359, Validation cost= 0.9487, Validation ACC= 0.5373 (0.9399)
Epoch    13: Training cost= 0.8811, Training ACC= 0.5389, Validation cost= 0.9422, Validation ACC= 0.5403 (0.9401)
Epoch    14: Training cost= 0.8725, Training ACC= 0.5418, Validation cost= 0.9465, Validation ACC= 0.5432 (0.9413)
Epoch    15: Training cost= 0.8665, Training ACC= 0.5446, Validation cost= 0.9542, Validation ACC= 0.5459 (0.9433)
Epoch    16: Training cost= 0.8612, Training ACC= 0.5473, Validation cost= 0.9555, Validation ACC= 0.5485 (0.9450)
MNLI-mm normal 256 11077191 433.9111 27.1194
