Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  1785800   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,060,234
Trainable params: 2,060,234
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6487, Training ACC= 0.6006, Validation cost= 0.6169, Validation ACC= 0.6576 (......)
Epoch     2: Training cost= 0.6249, Training ACC= 0.6595, Validation cost= 0.6159, Validation ACC= 0.6678 (......)
Epoch     3: Training cost= 0.6126, Training ACC= 0.6696, Validation cost= 0.5582, Validation ACC= 0.6738 (......)
Epoch     4: Training cost= 0.6116, Training ACC= 0.6752, Validation cost= 0.6283, Validation ACC= 0.6762 (......)
Epoch     5: Training cost= 0.5983, Training ACC= 0.6780, Validation cost= 0.6149, Validation ACC= 0.6790 (......)
Epoch     6: Training cost= 0.5869, Training ACC= 0.6801, Validation cost= 0.5817, Validation ACC= 0.6814 (......)
Epoch     7: Training cost= 0.5825, Training ACC= 0.6831, Validation cost= 0.6208, Validation ACC= 0.6841 (......)
Epoch     8: Training cost= 0.5670, Training ACC= 0.6852, Validation cost= 0.6092, Validation ACC= 0.6871 (......)
Epoch     9: Training cost= 0.5468, Training ACC= 0.6887, Validation cost= 0.6113, Validation ACC= 0.6907 (......)
Epoch    10: Training cost= 0.5259, Training ACC= 0.6928, Validation cost= 0.5836, Validation ACC= 0.6943 (0.6041)
Epoch    11: Training cost= 0.5002, Training ACC= 0.6965, Validation cost= 0.5956, Validation ACC= 0.6990 (0.6019)
Epoch    12: Training cost= 0.4746, Training ACC= 0.7021, Validation cost= 0.6760, Validation ACC= 0.7044 (0.6080)
Epoch    13: Training cost= 0.4539, Training ACC= 0.7072, Validation cost= 0.6247, Validation ACC= 0.7097 (0.6146)
Epoch    14: Training cost= 0.4210, Training ACC= 0.7127, Validation cost= 0.5936, Validation ACC= 0.7154 (0.6111)
Epoch    15: Training cost= 0.3914, Training ACC= 0.7188, Validation cost= 0.6416, Validation ACC= 0.7214 (0.6138)
Epoch    16: Training cost= 0.3840, Training ACC= 0.7244, Validation cost= 0.7115, Validation ACC= 0.7269 (0.6268)
MRPC normal 256 2060234 1.9234 0.1202
