Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,151,734
Trainable params: 11,151,734
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6815, Training ACC= 0.5456, Validation cost= 0.6690, Validation ACC= 0.5654 (......)
Epoch     2: Training cost= 0.6674, Training ACC= 0.5744, Validation cost= 0.6637, Validation ACC= 0.5802 (......)
Epoch     3: Training cost= 0.6572, Training ACC= 0.5856, Validation cost= 0.6548, Validation ACC= 0.5901 (......)
Epoch     4: Training cost= 0.6413, Training ACC= 0.5954, Validation cost= 0.6590, Validation ACC= 0.5995 (......)
Epoch     5: Training cost= 0.6199, Training ACC= 0.6053, Validation cost= 0.6570, Validation ACC= 0.6102 (......)
Epoch     6: Training cost= 0.5965, Training ACC= 0.6163, Validation cost= 0.6791, Validation ACC= 0.6213 (......)
Epoch     7: Training cost= 0.5703, Training ACC= 0.6272, Validation cost= 0.6820, Validation ACC= 0.6320 (......)
Epoch     8: Training cost= 0.5459, Training ACC= 0.6376, Validation cost= 0.7262, Validation ACC= 0.6422 (......)
Epoch     9: Training cost= 0.5267, Training ACC= 0.6472, Validation cost= 0.7226, Validation ACC= 0.6512 (......)
Epoch    10: Training cost= 0.5074, Training ACC= 0.6556, Validation cost= 0.7486, Validation ACC= 0.6594 (0.6862)
Epoch    11: Training cost= 0.4940, Training ACC= 0.6633, Validation cost= 0.7403, Validation ACC= 0.6666 (0.6933)
Epoch    12: Training cost= 0.4785, Training ACC= 0.6702, Validation cost= 0.7955, Validation ACC= 0.6733 (0.7065)
Epoch    13: Training cost= 0.4691, Training ACC= 0.6765, Validation cost= 0.7831, Validation ACC= 0.6792 (0.7193)
Epoch    14: Training cost= 0.4569, Training ACC= 0.6820, Validation cost= 0.8102, Validation ACC= 0.6846 (0.7345)
Epoch    15: Training cost= 0.4460, Training ACC= 0.6872, Validation cost= 0.8649, Validation ACC= 0.6894 (0.7552)
QNLI normal 256 11151734 113.9569 7.5971
