Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,964,642
Trainable params: 1,964,642
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5489, Training ACC= 0.6439, Validation cost= 0.4686, Validation ACC= 0.7005 (......)
Epoch     2: Training cost= 0.4325, Training ACC= 0.7293, Validation cost= 0.4779, Validation ACC= 0.7505 (......)
Epoch     3: Training cost= 0.3819, Training ACC= 0.7653, Validation cost= 0.4803, Validation ACC= 0.7769 (......)
Epoch     4: Training cost= 0.3504, Training ACC= 0.7864, Validation cost= 0.4925, Validation ACC= 0.7944 (......)
Epoch     5: Training cost= 0.3271, Training ACC= 0.8011, Validation cost= 0.5007, Validation ACC= 0.8069 (......)
Epoch     6: Training cost= 0.3088, Training ACC= 0.8121, Validation cost= 0.5464, Validation ACC= 0.8165 (......)
Epoch     7: Training cost= 0.3018, Training ACC= 0.8204, Validation cost= 0.5381, Validation ACC= 0.8238 (......)
Epoch     8: Training cost= 0.2899, Training ACC= 0.8270, Validation cost= 0.6075, Validation ACC= 0.8299 (......)
Epoch     9: Training cost= 0.2829, Training ACC= 0.8326, Validation cost= 0.6305, Validation ACC= 0.8350 (......)
Epoch    10: Training cost= 0.2771, Training ACC= 0.8372, Validation cost= 0.5773, Validation ACC= 0.8391 (0.5320)
Epoch    11: Training cost= 0.2702, Training ACC= 0.8412, Validation cost= 0.6116, Validation ACC= 0.8430 (0.5463)
Epoch    12: Training cost= 0.2629, Training ACC= 0.8449, Validation cost= 0.7119, Validation ACC= 0.8465 (0.5697)
Epoch    13: Training cost= 0.2614, Training ACC= 0.8480, Validation cost= 0.7329, Validation ACC= 0.8494 (0.5949)
Epoch    14: Training cost= 0.2559, Training ACC= 0.8508, Validation cost= 0.6418, Validation ACC= 0.8521 (0.6099)
Epoch    15: Training cost= 0.2490, Training ACC= 0.8535, Validation cost= 0.7226, Validation ACC= 0.8547 (0.6321)
SST-2 normal 256 1964642 12.9158 0.8611
