Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  608600    
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 636,186
Trainable params: 636,186
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6314, Training ACC= 0.6780, Validation cost= 0.6212, Validation ACC= 0.6948 (......)
Epoch     2: Training cost= 0.6118, Training ACC= 0.6978, Validation cost= 0.6195, Validation ACC= 0.6988 (......)
Epoch     3: Training cost= 0.6077, Training ACC= 0.6994, Validation cost= 0.6195, Validation ACC= 0.7003 (......)
Epoch     4: Training cost= 0.6045, Training ACC= 0.6999, Validation cost= 0.6173, Validation ACC= 0.7009 (......)
Epoch     5: Training cost= 0.6015, Training ACC= 0.7015, Validation cost= 0.6136, Validation ACC= 0.7013 (......)
Epoch     6: Training cost= 0.6004, Training ACC= 0.7014, Validation cost= 0.6153, Validation ACC= 0.7016 (......)
Epoch     7: Training cost= 0.5952, Training ACC= 0.7017, Validation cost= 0.6123, Validation ACC= 0.7018 (......)
Epoch     8: Training cost= 0.5890, Training ACC= 0.7020, Validation cost= 0.6127, Validation ACC= 0.7020 (......)
Epoch     9: Training cost= 0.5748, Training ACC= 0.7020, Validation cost= 0.6159, Validation ACC= 0.7020 (......)
Epoch    10: Training cost= 0.5584, Training ACC= 0.7020, Validation cost= 0.6186, Validation ACC= 0.7021 (0.6166)
Epoch    11: Training cost= 0.5362, Training ACC= 0.7020, Validation cost= 0.6460, Validation ACC= 0.7022 (0.6191)
Epoch    12: Training cost= 0.5157, Training ACC= 0.7023, Validation cost= 0.6490, Validation ACC= 0.7025 (0.6220)
Epoch    13: Training cost= 0.4954, Training ACC= 0.7032, Validation cost= 0.6979, Validation ACC= 0.7037 (0.6299)
Epoch    14: Training cost= 0.4705, Training ACC= 0.7051, Validation cost= 0.7582, Validation ACC= 0.7061 (0.6439)
Epoch    15: Training cost= 0.4589, Training ACC= 0.7074, Validation cost= 0.8341, Validation ACC= 0.7084 (0.6660)
CoLA linear 64 636186 1.7805 0.1187
