Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,650,111
Trainable params: 10,650,111
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0353, Training ACC= 0.3834, Validation cost= 0.9636, Validation ACC= 0.4361 (......)
Epoch     2: Training cost= 0.9545, Training ACC= 0.4614, Validation cost= 0.9246, Validation ACC= 0.4803 (......)
Epoch     3: Training cost= 0.9168, Training ACC= 0.4940, Validation cost= 0.9079, Validation ACC= 0.5050 (......)
Epoch     4: Training cost= 0.8846, Training ACC= 0.5147, Validation cost= 0.9145, Validation ACC= 0.5226 (......)
Epoch     5: Training cost= 0.8542, Training ACC= 0.5304, Validation cost= 0.9160, Validation ACC= 0.5369 (......)
Epoch     6: Training cost= 0.8278, Training ACC= 0.5435, Validation cost= 0.9278, Validation ACC= 0.5490 (......)
Epoch     7: Training cost= 0.8038, Training ACC= 0.5546, Validation cost= 0.9424, Validation ACC= 0.5593 (......)
Epoch     8: Training cost= 0.7811, Training ACC= 0.5643, Validation cost= 0.9758, Validation ACC= 0.5685 (......)
Epoch     9: Training cost= 0.7609, Training ACC= 0.5730, Validation cost= 0.9938, Validation ACC= 0.5768 (......)
Epoch    10: Training cost= 0.7421, Training ACC= 0.5808, Validation cost= 0.9970, Validation ACC= 0.5844 (0.9463)
Epoch    11: Training cost= 0.7250, Training ACC= 0.5881, Validation cost= 1.0550, Validation ACC= 0.5913 (0.9555)
Epoch    12: Training cost= 0.7102, Training ACC= 0.5947, Validation cost= 1.0952, Validation ACC= 0.5977 (0.9725)
Epoch    13: Training cost= 0.6954, Training ACC= 0.6009, Validation cost= 1.1556, Validation ACC= 0.6036 (0.9973)
Epoch    14: Training cost= 0.6827, Training ACC= 0.6066, Validation cost= 1.1542, Validation ACC= 0.6092 (1.0213)
Epoch    15: Training cost= 0.6687, Training ACC= 0.6120, Validation cost= 1.2300, Validation ACC= 0.6145 (1.0527)
MNLI-m linear 64 10650111 159.1323 10.6088
