Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,834,311
Trainable params: 10,834,311
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0392, Training ACC= 0.3776, Validation cost= 0.9450, Validation ACC= 0.4326 (......)
Epoch     2: Training cost= 0.9502, Training ACC= 0.4616, Validation cost= 0.9133, Validation ACC= 0.4819 (......)
Epoch     3: Training cost= 0.9126, Training ACC= 0.4964, Validation cost= 0.9047, Validation ACC= 0.5075 (......)
Epoch     4: Training cost= 0.8787, Training ACC= 0.5175, Validation cost= 0.9040, Validation ACC= 0.5257 (......)
Epoch     5: Training cost= 0.8496, Training ACC= 0.5336, Validation cost= 0.9132, Validation ACC= 0.5401 (......)
Epoch     6: Training cost= 0.8220, Training ACC= 0.5466, Validation cost= 0.9325, Validation ACC= 0.5520 (......)
Epoch     7: Training cost= 0.7962, Training ACC= 0.5577, Validation cost= 0.9689, Validation ACC= 0.5625 (......)
Epoch     8: Training cost= 0.7733, Training ACC= 0.5675, Validation cost= 0.9756, Validation ACC= 0.5718 (......)
Epoch     9: Training cost= 0.7530, Training ACC= 0.5763, Validation cost= 1.0038, Validation ACC= 0.5801 (......)
Epoch    10: Training cost= 0.7330, Training ACC= 0.5843, Validation cost= 1.0175, Validation ACC= 0.5878 (0.9478)
Epoch    11: Training cost= 0.7162, Training ACC= 0.5916, Validation cost= 1.0752, Validation ACC= 0.5949 (0.9609)
Epoch    12: Training cost= 0.6995, Training ACC= 0.5983, Validation cost= 1.0582, Validation ACC= 0.6014 (0.9754)
Epoch    13: Training cost= 0.6841, Training ACC= 0.6047, Validation cost= 1.1090, Validation ACC= 0.6075 (0.9958)
Epoch    14: Training cost= 0.6702, Training ACC= 0.6106, Validation cost= 1.1562, Validation ACC= 0.6133 (1.0210)
Epoch    15: Training cost= 0.6570, Training ACC= 0.6162, Validation cost= 1.1627, Validation ACC= 0.6187 (1.0460)
MNLI-mm linear 64 10834311 157.1786 10.4786
