Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,909,046
Trainable params: 10,909,046
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6899, Training ACC= 0.5135, Validation cost= 0.6712, Validation ACC= 0.5338 (......)
Epoch     2: Training cost= 0.6647, Training ACC= 0.5533, Validation cost= 0.6497, Validation ACC= 0.5675 (......)
Epoch     3: Training cost= 0.6391, Training ACC= 0.5793, Validation cost= 0.6477, Validation ACC= 0.5886 (......)
Epoch     4: Training cost= 0.6023, Training ACC= 0.5986, Validation cost= 0.6685, Validation ACC= 0.6065 (......)
Epoch     5: Training cost= 0.5545, Training ACC= 0.6162, Validation cost= 0.7179, Validation ACC= 0.6239 (......)
Epoch     6: Training cost= 0.5120, Training ACC= 0.6322, Validation cost= 0.7551, Validation ACC= 0.6391 (......)
Epoch     7: Training cost= 0.4746, Training ACC= 0.6464, Validation cost= 0.8620, Validation ACC= 0.6524 (......)
Epoch     8: Training cost= 0.4434, Training ACC= 0.6587, Validation cost= 0.9970, Validation ACC= 0.6640 (......)
Epoch     9: Training cost= 0.4157, Training ACC= 0.6696, Validation cost= 1.1884, Validation ACC= 0.6743 (......)
Epoch    10: Training cost= 0.3879, Training ACC= 0.6794, Validation cost= 1.4781, Validation ACC= 0.6838 (0.8636)
Epoch    11: Training cost= 0.3654, Training ACC= 0.6888, Validation cost= 1.5182, Validation ACC= 0.6930 (0.9483)
Epoch    12: Training cost= 0.3433, Training ACC= 0.6976, Validation cost= 2.2252, Validation ACC= 0.7017 (1.1058)
Epoch    13: Training cost= 0.3229, Training ACC= 0.7062, Validation cost= 2.2650, Validation ACC= 0.7101 (1.2675)
Epoch    14: Training cost= 0.3038, Training ACC= 0.7144, Validation cost= 2.4511, Validation ACC= 0.7182 (1.4458)
Epoch    15: Training cost= 0.2861, Training ACC= 0.7223, Validation cost= 2.7992, Validation ACC= 0.7260 (1.6539)
QNLI linear 64 10909046 44.1044 2.9403
