Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  4160      
_________________________________________________________________
dense_6 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,441,746
Trainable params: 21,441,746
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5587, Training ACC= 0.6641, Validation cost= 0.4966, Validation ACC= 0.7105 (......)
Epoch     2: Training cost= 0.4733, Training ACC= 0.7303, Validation cost= 0.4784, Validation ACC= 0.7432 (......)
Epoch     3: Training cost= 0.4347, Training ACC= 0.7529, Validation cost= 0.4856, Validation ACC= 0.7602 (......)
Epoch     4: Training cost= 0.4054, Training ACC= 0.7670, Validation cost= 0.4962, Validation ACC= 0.7721 (......)
Epoch     5: Training cost= 0.3820, Training ACC= 0.7773, Validation cost= 0.5395, Validation ACC= 0.7814 (......)
Epoch     6: Training cost= 0.3611, Training ACC= 0.7856, Validation cost= 0.5685, Validation ACC= 0.7889 (......)
Epoch     7: Training cost= 0.3427, Training ACC= 0.7925, Validation cost= 0.6522, Validation ACC= 0.7956 (......)
Epoch     8: Training cost= 0.3272, Training ACC= 0.7987, Validation cost= 0.6789, Validation ACC= 0.8014 (......)
Epoch     9: Training cost= 0.3130, Training ACC= 0.8042, Validation cost= 0.9301, Validation ACC= 0.8065 (......)
Epoch    10: Training cost= 0.3016, Training ACC= 0.8090, Validation cost= 1.0812, Validation ACC= 0.8111 (0.6407)
Epoch    11: Training cost= 0.2905, Training ACC= 0.8134, Validation cost= 1.2218, Validation ACC= 0.8153 (0.7132)
Epoch    12: Training cost= 0.2808, Training ACC= 0.8174, Validation cost= 1.3785, Validation ACC= 0.8192 (0.8033)
Epoch    13: Training cost= 0.2721, Training ACC= 0.8211, Validation cost= 1.4209, Validation ACC= 0.8228 (0.8968)
Epoch    14: Training cost= 0.2644, Training ACC= 0.8245, Validation cost= 1.3010, Validation ACC= 0.8261 (0.9773)
Epoch    15: Training cost= 0.2570, Training ACC= 0.8277, Validation cost= 1.2620, Validation ACC= 0.8291 (1.0495)
QQP linear 64 21441746 156.2893 10.4193
