Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  23296     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  4160      
_________________________________________________________________
dense_5 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,783,586
Trainable params: 1,783,586
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5246, Training ACC= 0.6200, Validation cost= 0.4327, Validation ACC= 0.7199 (......)
Epoch     2: Training cost= 0.3036, Training ACC= 0.7659, Validation cost= 0.4360, Validation ACC= 0.7980 (......)
Epoch     3: Training cost= 0.2315, Training ACC= 0.8188, Validation cost= 0.4779, Validation ACC= 0.8351 (......)
Epoch     4: Training cost= 0.1929, Training ACC= 0.8475, Validation cost= 0.5237, Validation ACC= 0.8577 (......)
Epoch     5: Training cost= 0.1668, Training ACC= 0.8662, Validation cost= 0.5252, Validation ACC= 0.8732 (......)
Epoch     6: Training cost= 0.1477, Training ACC= 0.8797, Validation cost= 0.6494, Validation ACC= 0.8849 (......)
Epoch     7: Training cost= 0.1343, Training ACC= 0.8897, Validation cost= 0.6825, Validation ACC= 0.8938 (......)
Epoch     8: Training cost= 0.1217, Training ACC= 0.8978, Validation cost= 0.8199, Validation ACC= 0.9012 (......)
Epoch     9: Training cost= 0.1117, Training ACC= 0.9044, Validation cost= 0.8742, Validation ACC= 0.9071 (......)
Epoch    10: Training cost= 0.1052, Training ACC= 0.9098, Validation cost= 0.6749, Validation ACC= 0.9121 (0.6096)
Epoch    11: Training cost= 0.0971, Training ACC= 0.9145, Validation cost= 0.9319, Validation ACC= 0.9166 (0.6596)
Epoch    12: Training cost= 0.0913, Training ACC= 0.9186, Validation cost= 0.9927, Validation ACC= 0.9204 (0.7152)
Epoch    13: Training cost= 0.0850, Training ACC= 0.9222, Validation cost= 1.0703, Validation ACC= 0.9237 (0.7745)
Epoch    14: Training cost= 0.0792, Training ACC= 0.9254, Validation cost= 1.2502, Validation ACC= 0.9268 (0.8471)
Epoch    15: Training cost= 0.0756, Training ACC= 0.9283, Validation cost= 1.1946, Validation ACC= 0.9296 (0.9141)
SST-2 linear 64 1783586 8.0381 0.5359
