Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  608600    
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 817,242
Trainable params: 817,242
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6188, Training ACC= 0.6972, Validation cost= 0.6171, Validation ACC= 0.7009 (......)
Epoch     2: Training cost= 0.6090, Training ACC= 0.7018, Validation cost= 0.6160, Validation ACC= 0.7017 (......)
Epoch     3: Training cost= 0.6055, Training ACC= 0.7018, Validation cost= 0.6164, Validation ACC= 0.7023 (......)
Epoch     4: Training cost= 0.6025, Training ACC= 0.7016, Validation cost= 0.6143, Validation ACC= 0.7023 (......)
Epoch     5: Training cost= 0.5976, Training ACC= 0.7028, Validation cost= 0.6074, Validation ACC= 0.7025 (......)
Epoch     6: Training cost= 0.5903, Training ACC= 0.7024, Validation cost= 0.6148, Validation ACC= 0.7025 (......)
Epoch     7: Training cost= 0.5805, Training ACC= 0.7025, Validation cost= 0.6182, Validation ACC= 0.7025 (......)
Epoch     8: Training cost= 0.5633, Training ACC= 0.7027, Validation cost= 0.6092, Validation ACC= 0.7027 (......)
Epoch     9: Training cost= 0.5424, Training ACC= 0.7028, Validation cost= 0.6330, Validation ACC= 0.7027 (......)
Epoch    10: Training cost= 0.5085, Training ACC= 0.7033, Validation cost= 0.6829, Validation ACC= 0.7041 (0.6229)
Epoch    11: Training cost= 0.4866, Training ACC= 0.7057, Validation cost= 0.6966, Validation ACC= 0.7070 (0.6309)
Epoch    12: Training cost= 0.4663, Training ACC= 0.7089, Validation cost= 0.6935, Validation ACC= 0.7101 (0.6386)
Epoch    13: Training cost= 0.4500, Training ACC= 0.7119, Validation cost= 0.7749, Validation ACC= 0.7131 (0.6545)
Epoch    14: Training cost= 0.4227, Training ACC= 0.7149, Validation cost= 0.9191, Validation ACC= 0.7167 (0.6850)
Epoch    15: Training cost= 0.4113, Training ACC= 0.7186, Validation cost= 1.0351, Validation ACC= 0.7202 (0.7277)
CoLA linear 256 817242 2.9387 0.1959
