Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,892,991
Trainable params: 10,892,991
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.9956, Training ACC= 0.4216, Validation cost= 0.9166, Validation ACC= 0.4828 (......)
Epoch     2: Training cost= 0.9077, Training ACC= 0.5068, Validation cost= 0.8874, Validation ACC= 0.5236 (......)
Epoch     3: Training cost= 0.8599, Training ACC= 0.5374, Validation cost= 0.8734, Validation ACC= 0.5481 (......)
Epoch     4: Training cost= 0.8166, Training ACC= 0.5585, Validation cost= 0.8736, Validation ACC= 0.5668 (......)
Epoch     5: Training cost= 0.7768, Training ACC= 0.5753, Validation cost= 0.8846, Validation ACC= 0.5820 (......)
Epoch     6: Training cost= 0.7419, Training ACC= 0.5893, Validation cost= 0.9142, Validation ACC= 0.5952 (......)
Epoch     7: Training cost= 0.7106, Training ACC= 0.6016, Validation cost= 0.9518, Validation ACC= 0.6069 (......)
Epoch     8: Training cost= 0.6802, Training ACC= 0.6127, Validation cost= 1.0028, Validation ACC= 0.6175 (......)
Epoch     9: Training cost= 0.6535, Training ACC= 0.6227, Validation cost= 1.0121, Validation ACC= 0.6271 (......)
Epoch    10: Training cost= 0.6303, Training ACC= 0.6318, Validation cost= 1.0656, Validation ACC= 0.6358 (0.9382)
Epoch    11: Training cost= 0.6089, Training ACC= 0.6402, Validation cost= 1.1625, Validation ACC= 0.6440 (0.9628)
Epoch    12: Training cost= 0.5880, Training ACC= 0.6481, Validation cost= 1.1821, Validation ACC= 0.6516 (0.9923)
Epoch    13: Training cost= 0.5697, Training ACC= 0.6554, Validation cost= 1.2850, Validation ACC= 0.6587 (1.0334)
Epoch    14: Training cost= 0.5514, Training ACC= 0.6623, Validation cost= 1.2993, Validation ACC= 0.6654 (1.0760)
Epoch    15: Training cost= 0.5365, Training ACC= 0.6687, Validation cost= 1.3229, Validation ACC= 0.6717 (1.1198)
MNLI-m linear 256 10892991 440.4477 29.3632
