Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,077,191
Trainable params: 11,077,191
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.9959, Training ACC= 0.4220, Validation cost= 0.9087, Validation ACC= 0.4819 (......)
Epoch     2: Training cost= 0.9089, Training ACC= 0.5057, Validation cost= 0.8865, Validation ACC= 0.5225 (......)
Epoch     3: Training cost= 0.8615, Training ACC= 0.5363, Validation cost= 0.8763, Validation ACC= 0.5469 (......)
Epoch     4: Training cost= 0.8183, Training ACC= 0.5571, Validation cost= 0.8784, Validation ACC= 0.5653 (......)
Epoch     5: Training cost= 0.7796, Training ACC= 0.5737, Validation cost= 0.9002, Validation ACC= 0.5805 (......)
Epoch     6: Training cost= 0.7437, Training ACC= 0.5878, Validation cost= 0.9095, Validation ACC= 0.5938 (......)
Epoch     7: Training cost= 0.7110, Training ACC= 0.6003, Validation cost= 0.9505, Validation ACC= 0.6058 (......)
Epoch     8: Training cost= 0.6804, Training ACC= 0.6116, Validation cost= 1.0013, Validation ACC= 0.6164 (......)
Epoch     9: Training cost= 0.6532, Training ACC= 0.6217, Validation cost= 1.0410, Validation ACC= 0.6261 (......)
Epoch    10: Training cost= 0.6296, Training ACC= 0.6310, Validation cost= 1.0442, Validation ACC= 0.6350 (0.9397)
Epoch    11: Training cost= 0.6066, Training ACC= 0.6395, Validation cost= 1.0896, Validation ACC= 0.6433 (0.9578)
Epoch    12: Training cost= 0.5863, Training ACC= 0.6475, Validation cost= 1.1652, Validation ACC= 0.6510 (0.9856)
Epoch    13: Training cost= 0.5679, Training ACC= 0.6549, Validation cost= 1.2200, Validation ACC= 0.6582 (1.0200)
Epoch    14: Training cost= 0.5500, Training ACC= 0.6619, Validation cost= 1.2680, Validation ACC= 0.6650 (1.0590)
Epoch    15: Training cost= 0.5337, Training ACC= 0.6684, Validation cost= 1.3239, Validation ACC= 0.6713 (1.1013)
MNLI-mm linear 256 11077191 442.6849 29.5123
