Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  1785800   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,060,234
Trainable params: 2,060,234
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6552, Training ACC= 0.6042, Validation cost= 0.5930, Validation ACC= 0.6581 (......)
Epoch     2: Training cost= 0.6128, Training ACC= 0.6593, Validation cost= 0.6064, Validation ACC= 0.6668 (......)
Epoch     3: Training cost= 0.6101, Training ACC= 0.6675, Validation cost= 0.5633, Validation ACC= 0.6704 (......)
Epoch     4: Training cost= 0.6048, Training ACC= 0.6709, Validation cost= 0.6227, Validation ACC= 0.6714 (......)
Epoch     5: Training cost= 0.5972, Training ACC= 0.6715, Validation cost= 0.6108, Validation ACC= 0.6723 (......)
Epoch     6: Training cost= 0.5911, Training ACC= 0.6723, Validation cost= 0.5805, Validation ACC= 0.6732 (......)
Epoch     7: Training cost= 0.5872, Training ACC= 0.6735, Validation cost= 0.6275, Validation ACC= 0.6738 (......)
Epoch     8: Training cost= 0.5832, Training ACC= 0.6744, Validation cost= 0.5964, Validation ACC= 0.6754 (......)
Epoch     9: Training cost= 0.5687, Training ACC= 0.6760, Validation cost= 0.6078, Validation ACC= 0.6772 (......)
Epoch    10: Training cost= 0.5575, Training ACC= 0.6784, Validation cost= 0.5929, Validation ACC= 0.6791 (0.6001)
Epoch    11: Training cost= 0.5495, Training ACC= 0.6797, Validation cost= 0.5799, Validation ACC= 0.6811 (0.5988)
Epoch    12: Training cost= 0.5273, Training ACC= 0.6825, Validation cost= 0.6089, Validation ACC= 0.6837 (0.5991)
Epoch    13: Training cost= 0.5112, Training ACC= 0.6849, Validation cost= 0.5771, Validation ACC= 0.6862 (0.6005)
Epoch    14: Training cost= 0.4847, Training ACC= 0.6881, Validation cost= 0.6453, Validation ACC= 0.6898 (0.6027)
Epoch    15: Training cost= 0.4538, Training ACC= 0.6919, Validation cost= 0.6714, Validation ACC= 0.6933 (0.6088)
Epoch    16: Training cost= 0.4144, Training ACC= 0.6960, Validation cost= 0.6557, Validation ACC= 0.6986 (0.6163)
MRPC linear 256 2060234 2.6550 0.1659
