Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,151,734
Trainable params: 11,151,734
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6762, Training ACC= 0.5373, Validation cost= 0.6463, Validation ACC= 0.5704 (......)
Epoch     2: Training cost= 0.6476, Training ACC= 0.5849, Validation cost= 0.6501, Validation ACC= 0.5946 (......)
Epoch     3: Training cost= 0.6140, Training ACC= 0.6043, Validation cost= 0.6564, Validation ACC= 0.6116 (......)
Epoch     4: Training cost= 0.5649, Training ACC= 0.6214, Validation cost= 0.6675, Validation ACC= 0.6287 (......)
Epoch     5: Training cost= 0.5140, Training ACC= 0.6378, Validation cost= 0.7349, Validation ACC= 0.6448 (......)
Epoch     6: Training cost= 0.4688, Training ACC= 0.6528, Validation cost= 0.8502, Validation ACC= 0.6593 (......)
Epoch     7: Training cost= 0.4305, Training ACC= 0.6663, Validation cost= 0.9890, Validation ACC= 0.6720 (......)
Epoch     8: Training cost= 0.3946, Training ACC= 0.6785, Validation cost= 1.3705, Validation ACC= 0.6838 (......)
Epoch     9: Training cost= 0.3625, Training ACC= 0.6900, Validation cost= 1.7380, Validation ACC= 0.6953 (......)
Epoch    10: Training cost= 0.3329, Training ACC= 0.7012, Validation cost= 1.6554, Validation ACC= 0.7065 (0.9958)
Epoch    11: Training cost= 0.3028, Training ACC= 0.7124, Validation cost= 2.0253, Validation ACC= 0.7175 (1.1337)
Epoch    12: Training cost= 0.2778, Training ACC= 0.7232, Validation cost= 2.6560, Validation ACC= 0.7281 (1.3343)
Epoch    13: Training cost= 0.2565, Training ACC= 0.7335, Validation cost= 2.1800, Validation ACC= 0.7382 (1.4867)
Epoch    14: Training cost= 0.2350, Training ACC= 0.7432, Validation cost= 3.1494, Validation ACC= 0.7477 (1.7349)
Epoch    15: Training cost= 0.2154, Training ACC= 0.7524, Validation cost= 3.4200, Validation ACC= 0.7567 (2.0034)
QNLI linear 256 11151734 120.9765 8.0651
