Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  65792     
_________________________________________________________________
dense_6 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,684,434
Trainable params: 21,684,434
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5419, Training ACC= 0.6821, Validation cost= 0.4916, Validation ACC= 0.7250 (......)
Epoch     2: Training cost= 0.4641, Training ACC= 0.7414, Validation cost= 0.4726, Validation ACC= 0.7521 (......)
Epoch     3: Training cost= 0.4216, Training ACC= 0.7608, Validation cost= 0.4781, Validation ACC= 0.7673 (......)
Epoch     4: Training cost= 0.3882, Training ACC= 0.7736, Validation cost= 0.5083, Validation ACC= 0.7783 (......)
Epoch     5: Training cost= 0.3605, Training ACC= 0.7833, Validation cost= 0.5259, Validation ACC= 0.7873 (......)
Epoch     6: Training cost= 0.3367, Training ACC= 0.7914, Validation cost= 0.5836, Validation ACC= 0.7948 (......)
Epoch     7: Training cost= 0.3159, Training ACC= 0.7984, Validation cost= 0.6746, Validation ACC= 0.8016 (......)
Epoch     8: Training cost= 0.2986, Training ACC= 0.8049, Validation cost= 0.6861, Validation ACC= 0.8077 (......)
Epoch     9: Training cost= 0.2835, Training ACC= 0.8107, Validation cost= 0.7487, Validation ACC= 0.8133 (......)
Epoch    10: Training cost= 0.2697, Training ACC= 0.8160, Validation cost= 0.7834, Validation ACC= 0.8184 (0.5953)
Epoch    11: Training cost= 0.2573, Training ACC= 0.8209, Validation cost= 0.9025, Validation ACC= 0.8230 (0.6364)
Epoch    12: Training cost= 0.2464, Training ACC= 0.8253, Validation cost= 0.9970, Validation ACC= 0.8273 (0.6888)
Epoch    13: Training cost= 0.2361, Training ACC= 0.8294, Validation cost= 1.1657, Validation ACC= 0.8313 (0.7576)
Epoch    14: Training cost= 0.2275, Training ACC= 0.8333, Validation cost= 1.1534, Validation ACC= 0.8350 (0.8221)
Epoch    15: Training cost= 0.2181, Training ACC= 0.8369, Validation cost= 1.1166, Validation ACC= 0.8385 (0.8812)
QQP linear 256 21684434 405.4840 27.0323
