Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  142336    
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  65792     
_________________________________________________________________
dense_5 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,964,642
Trainable params: 1,964,642
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.4701, Training ACC= 0.6556, Validation cost= 0.4270, Validation ACC= 0.7590 (......)
Epoch     2: Training cost= 0.2695, Training ACC= 0.7972, Validation cost= 0.4517, Validation ACC= 0.8242 (......)
Epoch     3: Training cost= 0.2072, Training ACC= 0.8421, Validation cost= 0.5099, Validation ACC= 0.8559 (......)
Epoch     4: Training cost= 0.1718, Training ACC= 0.8665, Validation cost= 0.5656, Validation ACC= 0.8752 (......)
Epoch     5: Training cost= 0.1485, Training ACC= 0.8827, Validation cost= 0.5842, Validation ACC= 0.8887 (......)
Epoch     6: Training cost= 0.1303, Training ACC= 0.8942, Validation cost= 0.7426, Validation ACC= 0.8987 (......)
Epoch     7: Training cost= 0.1166, Training ACC= 0.9030, Validation cost= 0.7326, Validation ACC= 0.9065 (......)
Epoch     8: Training cost= 0.1058, Training ACC= 0.9099, Validation cost= 0.8812, Validation ACC= 0.9129 (......)
Epoch     9: Training cost= 0.0962, Training ACC= 0.9157, Validation cost= 0.9761, Validation ACC= 0.9182 (......)
Epoch    10: Training cost= 0.0878, Training ACC= 0.9206, Validation cost= 0.8526, Validation ACC= 0.9227 (0.6724)
Epoch    11: Training cost= 0.0819, Training ACC= 0.9248, Validation cost= 0.9152, Validation ACC= 0.9267 (0.7212)
Epoch    12: Training cost= 0.0762, Training ACC= 0.9285, Validation cost= 1.1017, Validation ACC= 0.9301 (0.7862)
Epoch    13: Training cost= 0.0706, Training ACC= 0.9318, Validation cost= 1.1459, Validation ACC= 0.9332 (0.8498)
Epoch    14: Training cost= 0.0649, Training ACC= 0.9346, Validation cost= 1.3723, Validation ACC= 0.9359 (0.9304)
Epoch    15: Training cost= 0.0612, Training ACC= 0.9373, Validation cost= 1.6153, Validation ACC= 0.9384 (1.0335)
SST-2 linear 256 1964642 21.4988 1.4333
