Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,890,695
Trainable params: 10,890,695
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0398, Training ACC= 0.4059, Validation cost= 0.9627, Validation ACC= 0.4439 (......)
Epoch     2: Training cost= 0.9910, Training ACC= 0.4582, Validation cost= 0.9439, Validation ACC= 0.4685 (......)
Epoch     3: Training cost= 0.9732, Training ACC= 0.4758, Validation cost= 0.9418, Validation ACC= 0.4816 (......)
Epoch     4: Training cost= 0.9578, Training ACC= 0.4871, Validation cost= 0.9408, Validation ACC= 0.4916 (......)
Epoch     5: Training cost= 0.9463, Training ACC= 0.4958, Validation cost= 0.9390, Validation ACC= 0.4993 (......)
Epoch     6: Training cost= 0.9352, Training ACC= 0.5030, Validation cost= 0.9422, Validation ACC= 0.5062 (......)
Epoch     7: Training cost= 0.9275, Training ACC= 0.5092, Validation cost= 0.9358, Validation ACC= 0.5117 (......)
Epoch     8: Training cost= 0.9181, Training ACC= 0.5144, Validation cost= 0.9462, Validation ACC= 0.5168 (......)
Epoch     9: Training cost= 0.9110, Training ACC= 0.5190, Validation cost= 0.9469, Validation ACC= 0.5210 (......)
Epoch    10: Training cost= 0.9041, Training ACC= 0.5232, Validation cost= 0.9469, Validation ACC= 0.5250 (0.9446)
Epoch    11: Training cost= 0.8959, Training ACC= 0.5270, Validation cost= 0.9472, Validation ACC= 0.5287 (0.9431)
Epoch    12: Training cost= 0.8891, Training ACC= 0.5305, Validation cost= 0.9552, Validation ACC= 0.5321 (0.9442)
Epoch    13: Training cost= 0.8835, Training ACC= 0.5338, Validation cost= 0.9496, Validation ACC= 0.5353 (0.9450)
Epoch    14: Training cost= 0.8745, Training ACC= 0.5370, Validation cost= 0.9492, Validation ACC= 0.5384 (0.9458)
Epoch    15: Training cost= 0.8680, Training ACC= 0.5400, Validation cost= 0.9558, Validation ACC= 0.5414 (0.9475)
Epoch    16: Training cost= 0.8626, Training ACC= 0.5429, Validation cost= 0.9624, Validation ACC= 0.5442 (0.9495)
MNLI-mm normal 128 10890695 291.4806 18.2175
