Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,965,366
Trainable params: 10,965,366
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6867, Training ACC= 0.5263, Validation cost= 0.6713, Validation ACC= 0.5501 (......)
Epoch     2: Training cost= 0.6710, Training ACC= 0.5616, Validation cost= 0.6617, Validation ACC= 0.5699 (......)
Epoch     3: Training cost= 0.6600, Training ACC= 0.5765, Validation cost= 0.6564, Validation ACC= 0.5821 (......)
Epoch     4: Training cost= 0.6449, Training ACC= 0.5878, Validation cost= 0.6588, Validation ACC= 0.5923 (......)
Epoch     5: Training cost= 0.6237, Training ACC= 0.5984, Validation cost= 0.6568, Validation ACC= 0.6036 (......)
Epoch     6: Training cost= 0.6009, Training ACC= 0.6097, Validation cost= 0.6785, Validation ACC= 0.6148 (......)
Epoch     7: Training cost= 0.5765, Training ACC= 0.6209, Validation cost= 0.6797, Validation ACC= 0.6259 (......)
Epoch     8: Training cost= 0.5521, Training ACC= 0.6316, Validation cost= 0.7173, Validation ACC= 0.6363 (......)
Epoch     9: Training cost= 0.5340, Training ACC= 0.6415, Validation cost= 0.7292, Validation ACC= 0.6458 (......)
Epoch    10: Training cost= 0.5128, Training ACC= 0.6505, Validation cost= 0.7414, Validation ACC= 0.6545 (0.6851)
Epoch    11: Training cost= 0.4983, Training ACC= 0.6587, Validation cost= 0.7577, Validation ACC= 0.6622 (0.6937)
Epoch    12: Training cost= 0.4837, Training ACC= 0.6659, Validation cost= 0.7952, Validation ACC= 0.6691 (0.7071)
Epoch    13: Training cost= 0.4718, Training ACC= 0.6724, Validation cost= 0.7856, Validation ACC= 0.6753 (0.7200)
Epoch    14: Training cost= 0.4604, Training ACC= 0.6783, Validation cost= 0.7985, Validation ACC= 0.6809 (0.7340)
Epoch    15: Training cost= 0.4482, Training ACC= 0.6837, Validation cost= 0.8748, Validation ACC= 0.6862 (0.7558)
QNLI normal 128 10965366 77.3401 5.1560
