Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
attention (Attention)        multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,827,554
Trainable params: 1,827,554
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5661, Training ACC= 0.6248, Validation cost= 0.4725, Validation ACC= 0.6856 (......)
Epoch     2: Training cost= 0.4459, Training ACC= 0.7162, Validation cost= 0.4766, Validation ACC= 0.7393 (......)
Epoch     3: Training cost= 0.3937, Training ACC= 0.7552, Validation cost= 0.4785, Validation ACC= 0.7676 (......)
Epoch     4: Training cost= 0.3595, Training ACC= 0.7777, Validation cost= 0.4867, Validation ACC= 0.7862 (......)
Epoch     5: Training cost= 0.3347, Training ACC= 0.7936, Validation cost= 0.5049, Validation ACC= 0.7999 (......)
Epoch     6: Training cost= 0.3150, Training ACC= 0.8055, Validation cost= 0.5433, Validation ACC= 0.8104 (......)
Epoch     7: Training cost= 0.3058, Training ACC= 0.8146, Validation cost= 0.5523, Validation ACC= 0.8184 (......)
Epoch     8: Training cost= 0.2949, Training ACC= 0.8219, Validation cost= 0.5754, Validation ACC= 0.8250 (......)
Epoch     9: Training cost= 0.2878, Training ACC= 0.8279, Validation cost= 0.5895, Validation ACC= 0.8305 (......)
Epoch    10: Training cost= 0.2814, Training ACC= 0.8329, Validation cost= 0.5864, Validation ACC= 0.8351 (0.5266)
Epoch    11: Training cost= 0.2751, Training ACC= 0.8372, Validation cost= 0.6409, Validation ACC= 0.8391 (0.5435)
Epoch    12: Training cost= 0.2674, Training ACC= 0.8410, Validation cost= 0.6327, Validation ACC= 0.8427 (0.5591)
Epoch    13: Training cost= 0.2663, Training ACC= 0.8443, Validation cost= 0.6905, Validation ACC= 0.8457 (0.5803)
Epoch    14: Training cost= 0.2575, Training ACC= 0.8472, Validation cost= 0.6502, Validation ACC= 0.8486 (0.5966)
Epoch    15: Training cost= 0.2540, Training ACC= 0.8500, Validation cost= 0.7120, Validation ACC= 0.8513 (0.6173)
SST-2 normal 128 1827554 6.8261 0.4551
