Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,832,135
Trainable params: 10,832,135
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0637, Training ACC= 0.3637, Validation cost= 0.9920, Validation ACC= 0.4067 (......)
Epoch     2: Training cost= 0.9798, Training ACC= 0.4361, Validation cost= 0.9472, Validation ACC= 0.4578 (......)
Epoch     3: Training cost= 0.9378, Training ACC= 0.4742, Validation cost= 0.9177, Validation ACC= 0.4873 (......)
Epoch     4: Training cost= 0.9083, Training ACC= 0.4984, Validation cost= 0.9089, Validation ACC= 0.5076 (......)
Epoch     5: Training cost= 0.8843, Training ACC= 0.5159, Validation cost= 0.9125, Validation ACC= 0.5226 (......)
Epoch     6: Training cost= 0.8651, Training ACC= 0.5291, Validation cost= 0.9096, Validation ACC= 0.5345 (......)
Epoch     7: Training cost= 0.8470, Training ACC= 0.5399, Validation cost= 0.9170, Validation ACC= 0.5445 (......)
Epoch     8: Training cost= 0.8308, Training ACC= 0.5491, Validation cost= 0.9339, Validation ACC= 0.5530 (......)
Epoch     9: Training cost= 0.8163, Training ACC= 0.5571, Validation cost= 0.9329, Validation ACC= 0.5605 (......)
Epoch    10: Training cost= 0.8030, Training ACC= 0.5641, Validation cost= 0.9607, Validation ACC= 0.5672 (0.9332)
Epoch    11: Training cost= 0.7899, Training ACC= 0.5704, Validation cost= 0.9686, Validation ACC= 0.5733 (0.9309)
Epoch    12: Training cost= 0.7781, Training ACC= 0.5763, Validation cost= 0.9727, Validation ACC= 0.5789 (0.9334)
Epoch    13: Training cost= 0.7674, Training ACC= 0.5816, Validation cost= 0.9714, Validation ACC= 0.5840 (0.9388)
Epoch    14: Training cost= 0.7583, Training ACC= 0.5865, Validation cost= 0.9739, Validation ACC= 0.5887 (0.9453)
Epoch    15: Training cost= 0.7480, Training ACC= 0.5910, Validation cost= 1.0090, Validation ACC= 0.5931 (0.9550)
Epoch    16: Training cost= 0.7413, Training ACC= 0.5953, Validation cost= 1.0105, Validation ACC= 0.5972 (0.9651)
MNLI-mm relation 64 10832135 141.9654 8.8728
