Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,647,935
Trainable params: 10,647,935
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0616, Training ACC= 0.3657, Validation cost= 0.9949, Validation ACC= 0.4097 (......)
Epoch     2: Training cost= 0.9827, Training ACC= 0.4366, Validation cost= 0.9520, Validation ACC= 0.4568 (......)
Epoch     3: Training cost= 0.9421, Training ACC= 0.4723, Validation cost= 0.9259, Validation ACC= 0.4850 (......)
Epoch     4: Training cost= 0.9109, Training ACC= 0.4960, Validation cost= 0.9162, Validation ACC= 0.5050 (......)
Epoch     5: Training cost= 0.8869, Training ACC= 0.5133, Validation cost= 0.9100, Validation ACC= 0.5202 (......)
Epoch     6: Training cost= 0.8661, Training ACC= 0.5268, Validation cost= 0.9145, Validation ACC= 0.5322 (......)
Epoch     7: Training cost= 0.8490, Training ACC= 0.5377, Validation cost= 0.9181, Validation ACC= 0.5422 (......)
Epoch     8: Training cost= 0.8329, Training ACC= 0.5470, Validation cost= 0.9381, Validation ACC= 0.5510 (......)
Epoch     9: Training cost= 0.8175, Training ACC= 0.5552, Validation cost= 0.9355, Validation ACC= 0.5586 (......)
Epoch    10: Training cost= 0.8051, Training ACC= 0.5622, Validation cost= 0.9489, Validation ACC= 0.5653 (0.9354)
Epoch    11: Training cost= 0.7920, Training ACC= 0.5686, Validation cost= 0.9835, Validation ACC= 0.5714 (0.9343)
Epoch    12: Training cost= 0.7807, Training ACC= 0.5744, Validation cost= 0.9674, Validation ACC= 0.5770 (0.9358)
Epoch    13: Training cost= 0.7703, Training ACC= 0.5797, Validation cost= 0.9911, Validation ACC= 0.5821 (0.9423)
Epoch    14: Training cost= 0.7604, Training ACC= 0.5846, Validation cost= 0.9986, Validation ACC= 0.5868 (0.9506)
Epoch    15: Training cost= 0.7512, Training ACC= 0.5892, Validation cost= 1.0094, Validation ACC= 0.5913 (0.9605)
Epoch    16: Training cost= 0.7427, Training ACC= 0.5935, Validation cost= 1.0434, Validation ACC= 0.5954 (0.9734)
MNLI-m relation 64 10647935 140.8926 8.8058
