Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,906,870
Trainable params: 10,906,870
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6920, Training ACC= 0.5097, Validation cost= 0.6796, Validation ACC= 0.5218 (......)
Epoch     2: Training cost= 0.6691, Training ACC= 0.5424, Validation cost= 0.6563, Validation ACC= 0.5584 (......)
Epoch     3: Training cost= 0.6502, Training ACC= 0.5695, Validation cost= 0.6482, Validation ACC= 0.5782 (......)
Epoch     4: Training cost= 0.6316, Training ACC= 0.5864, Validation cost= 0.6460, Validation ACC= 0.5933 (......)
Epoch     5: Training cost= 0.6076, Training ACC= 0.6003, Validation cost= 0.6494, Validation ACC= 0.6064 (......)
Epoch     6: Training cost= 0.5783, Training ACC= 0.6128, Validation cost= 0.6654, Validation ACC= 0.6184 (......)
Epoch     7: Training cost= 0.5487, Training ACC= 0.6246, Validation cost= 0.6907, Validation ACC= 0.6297 (......)
Epoch     8: Training cost= 0.5217, Training ACC= 0.6353, Validation cost= 0.7133, Validation ACC= 0.6398 (......)
Epoch     9: Training cost= 0.4955, Training ACC= 0.6448, Validation cost= 0.7547, Validation ACC= 0.6489 (......)
Epoch    10: Training cost= 0.4747, Training ACC= 0.6534, Validation cost= 0.8002, Validation ACC= 0.6573 (0.6904)
Epoch    11: Training cost= 0.4530, Training ACC= 0.6613, Validation cost= 0.8083, Validation ACC= 0.6648 (0.7032)
Epoch    12: Training cost= 0.4361, Training ACC= 0.6685, Validation cost= 0.8697, Validation ACC= 0.6717 (0.7246)
Epoch    13: Training cost= 0.4198, Training ACC= 0.6752, Validation cost= 0.9649, Validation ACC= 0.6782 (0.7563)
Epoch    14: Training cost= 0.4023, Training ACC= 0.6816, Validation cost= 0.9589, Validation ACC= 0.6846 (0.7875)
Epoch    15: Training cost= 0.3890, Training ACC= 0.6878, Validation cost= 1.0028, Validation ACC= 0.6906 (0.8229)
QNLI relation 64 10906870 36.6104 2.4407
