Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,439,570
Trainable params: 21,439,570
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5710, Training ACC= 0.6588, Validation cost= 0.5089, Validation ACC= 0.7046 (......)
Epoch     2: Training cost= 0.4962, Training ACC= 0.7221, Validation cost= 0.4903, Validation ACC= 0.7334 (......)
Epoch     3: Training cost= 0.4680, Training ACC= 0.7417, Validation cost= 0.4792, Validation ACC= 0.7481 (......)
Epoch     4: Training cost= 0.4460, Training ACC= 0.7537, Validation cost= 0.4781, Validation ACC= 0.7580 (......)
Epoch     5: Training cost= 0.4272, Training ACC= 0.7621, Validation cost= 0.4712, Validation ACC= 0.7655 (......)
Epoch     6: Training cost= 0.4112, Training ACC= 0.7688, Validation cost= 0.4868, Validation ACC= 0.7714 (......)
Epoch     7: Training cost= 0.3982, Training ACC= 0.7741, Validation cost= 0.4817, Validation ACC= 0.7763 (......)
Epoch     8: Training cost= 0.3857, Training ACC= 0.7785, Validation cost= 0.4880, Validation ACC= 0.7803 (......)
Epoch     9: Training cost= 0.3767, Training ACC= 0.7822, Validation cost= 0.5153, Validation ACC= 0.7837 (......)
Epoch    10: Training cost= 0.3671, Training ACC= 0.7853, Validation cost= 0.5005, Validation ACC= 0.7867 (0.4900)
Epoch    11: Training cost= 0.3586, Training ACC= 0.7882, Validation cost= 0.5487, Validation ACC= 0.7894 (0.4940)
Epoch    12: Training cost= 0.3513, Training ACC= 0.7907, Validation cost= 0.5407, Validation ACC= 0.7918 (0.4990)
Epoch    13: Training cost= 0.3449, Training ACC= 0.7930, Validation cost= 0.5476, Validation ACC= 0.7940 (0.5059)
Epoch    14: Training cost= 0.3388, Training ACC= 0.7951, Validation cost= 0.5724, Validation ACC= 0.7961 (0.5153)
Epoch    15: Training cost= 0.3325, Training ACC= 0.7971, Validation cost= 0.5872, Validation ACC= 0.7980 (0.5269)
QQP relation 64 21439570 131.1496 8.7433
