Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,781,410
Trainable params: 1,781,410
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5798, Training ACC= 0.6022, Validation cost= 0.4896, Validation ACC= 0.6828 (......)
Epoch     2: Training cost= 0.3719, Training ACC= 0.7301, Validation cost= 0.4381, Validation ACC= 0.7651 (......)
Epoch     3: Training cost= 0.2833, Training ACC= 0.7884, Validation cost= 0.4275, Validation ACC= 0.8069 (......)
Epoch     4: Training cost= 0.2360, Training ACC= 0.8213, Validation cost= 0.4094, Validation ACC= 0.8332 (......)
Epoch     5: Training cost= 0.2039, Training ACC= 0.8430, Validation cost= 0.4267, Validation ACC= 0.8513 (......)
Epoch     6: Training cost= 0.1821, Training ACC= 0.8587, Validation cost= 0.4749, Validation ACC= 0.8649 (......)
Epoch     7: Training cost= 0.1672, Training ACC= 0.8704, Validation cost= 0.4816, Validation ACC= 0.8751 (......)
Epoch     8: Training cost= 0.1555, Training ACC= 0.8794, Validation cost= 0.4976, Validation ACC= 0.8833 (......)
Epoch     9: Training cost= 0.1425, Training ACC= 0.8869, Validation cost= 0.5435, Validation ACC= 0.8902 (......)
Epoch    10: Training cost= 0.1349, Training ACC= 0.8933, Validation cost= 0.4984, Validation ACC= 0.8960 (0.4687)
Epoch    11: Training cost= 0.1270, Training ACC= 0.8986, Validation cost= 0.5322, Validation ACC= 0.9009 (0.4730)
Epoch    12: Training cost= 0.1189, Training ACC= 0.9031, Validation cost= 0.5577, Validation ACC= 0.9051 (0.4849)
Epoch    13: Training cost= 0.1144, Training ACC= 0.9071, Validation cost= 0.5907, Validation ACC= 0.9089 (0.5013)
Epoch    14: Training cost= 0.1103, Training ACC= 0.9106, Validation cost= 0.6439, Validation ACC= 0.9122 (0.5247)
Epoch    15: Training cost= 0.1050, Training ACC= 0.9137, Validation cost= 0.5822, Validation ACC= 0.9151 (0.5403)
SST-2 relation 64 1781410 7.0717 0.4714
