Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,647,935
Trainable params: 10,647,935
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0991, Training ACC= 0.3361, Validation cost= 1.0906, Validation ACC= 0.3420 (......)
Epoch     2: Training cost= 1.0909, Training ACC= 0.3469, Validation cost= 1.0856, Validation ACC= 0.3509 (......)
Epoch     3: Training cost= 1.0869, Training ACC= 0.3551, Validation cost= 1.0830, Validation ACC= 0.3584 (......)
Epoch     4: Training cost= 1.0844, Training ACC= 0.3608, Validation cost= 1.0820, Validation ACC= 0.3631 (......)
Epoch     5: Training cost= 1.0821, Training ACC= 0.3656, Validation cost= 1.0825, Validation ACC= 0.3676 (......)
Epoch     6: Training cost= 1.0800, Training ACC= 0.3695, Validation cost= 1.0813, Validation ACC= 0.3713 (......)
Epoch     7: Training cost= 1.0778, Training ACC= 0.3728, Validation cost= 1.0814, Validation ACC= 0.3743 (......)
Epoch     8: Training cost= 1.0752, Training ACC= 0.3758, Validation cost= 1.0834, Validation ACC= 0.3770 (......)
Epoch     9: Training cost= 1.0726, Training ACC= 0.3783, Validation cost= 1.0850, Validation ACC= 0.3795 (......)
Epoch    10: Training cost= 1.0697, Training ACC= 0.3807, Validation cost= 1.0866, Validation ACC= 0.3817 (1.0841)
Epoch    11: Training cost= 1.0676, Training ACC= 0.3827, Validation cost= 1.0886, Validation ACC= 0.3835 (1.0839)
Epoch    12: Training cost= 1.0650, Training ACC= 0.3846, Validation cost= 1.0914, Validation ACC= 0.3854 (1.0845)
Epoch    13: Training cost= 1.0628, Training ACC= 0.3863, Validation cost= 1.0907, Validation ACC= 0.3870 (1.0853)
Epoch    14: Training cost= 1.0610, Training ACC= 0.3878, Validation cost= 1.0915, Validation ACC= 0.3884 (1.0862)
Epoch    15: Training cost= 1.0588, Training ACC= 0.3891, Validation cost= 1.0936, Validation ACC= 0.3897 (1.0874)
Epoch    16: Training cost= 1.0572, Training ACC= 0.3903, Validation cost= 1.0975, Validation ACC= 0.3908 (1.0890)
MNLI-m pmlp 64 10647935 141.2092 8.8256
