Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  195       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,832,135
Trainable params: 10,832,135
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.1000, Training ACC= 0.3352, Validation cost= 1.0961, Validation ACC= 0.3385 (......)
Epoch     2: Training cost= 1.0921, Training ACC= 0.3435, Validation cost= 1.0876, Validation ACC= 0.3469 (......)
Epoch     3: Training cost= 1.0877, Training ACC= 0.3499, Validation cost= 1.0840, Validation ACC= 0.3529 (......)
Epoch     4: Training cost= 1.0851, Training ACC= 0.3561, Validation cost= 1.0816, Validation ACC= 0.3587 (......)
Epoch     5: Training cost= 1.0832, Training ACC= 0.3612, Validation cost= 1.0817, Validation ACC= 0.3633 (......)
Epoch     6: Training cost= 1.0811, Training ACC= 0.3654, Validation cost= 1.0809, Validation ACC= 0.3673 (......)
Epoch     7: Training cost= 1.0788, Training ACC= 0.3691, Validation cost= 1.0805, Validation ACC= 0.3707 (......)
Epoch     8: Training cost= 1.0765, Training ACC= 0.3722, Validation cost= 1.0815, Validation ACC= 0.3735 (......)
Epoch     9: Training cost= 1.0744, Training ACC= 0.3750, Validation cost= 1.0828, Validation ACC= 0.3762 (......)
Epoch    10: Training cost= 1.0718, Training ACC= 0.3775, Validation cost= 1.0859, Validation ACC= 0.3787 (1.0843)
Epoch    11: Training cost= 1.0691, Training ACC= 0.3798, Validation cost= 1.0859, Validation ACC= 0.3808 (1.0832)
Epoch    12: Training cost= 1.0668, Training ACC= 0.3819, Validation cost= 1.0884, Validation ACC= 0.3828 (1.0833)
Epoch    13: Training cost= 1.0647, Training ACC= 0.3838, Validation cost= 1.0946, Validation ACC= 0.3846 (1.0844)
Epoch    14: Training cost= 1.0622, Training ACC= 0.3855, Validation cost= 1.0951, Validation ACC= 0.3862 (1.0857)
Epoch    15: Training cost= 1.0601, Training ACC= 0.3870, Validation cost= 1.0988, Validation ACC= 0.3877 (1.0874)
Epoch    16: Training cost= 1.0584, Training ACC= 0.3884, Validation cost= 1.1060, Validation ACC= 0.3890 (1.0900)
MNLI-mm pmlp 64 10832135 137.7376 8.6086
