Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,906,870
Trainable params: 10,906,870
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6963, Training ACC= 0.5054, Validation cost= 0.6931, Validation ACC= 0.5028 (......)
Epoch     2: Training cost= 0.6935, Training ACC= 0.5035, Validation cost= 0.6931, Validation ACC= 0.5036 (......)
Epoch     3: Training cost= 0.6930, Training ACC= 0.5039, Validation cost= 0.6930, Validation ACC= 0.5047 (......)
Epoch     4: Training cost= 0.6928, Training ACC= 0.5055, Validation cost= 0.6927, Validation ACC= 0.5065 (......)
Epoch     5: Training cost= 0.6924, Training ACC= 0.5073, Validation cost= 0.6924, Validation ACC= 0.5083 (......)
Epoch     6: Training cost= 0.6918, Training ACC= 0.5094, Validation cost= 0.6923, Validation ACC= 0.5105 (......)
Epoch     7: Training cost= 0.6890, Training ACC= 0.5121, Validation cost= 0.6926, Validation ACC= 0.5134 (......)
Epoch     8: Training cost= 0.6861, Training ACC= 0.5149, Validation cost= 0.6915, Validation ACC= 0.5165 (......)
Epoch     9: Training cost= 0.6816, Training ACC= 0.5181, Validation cost= 0.6925, Validation ACC= 0.5197 (......)
Epoch    10: Training cost= 0.6769, Training ACC= 0.5214, Validation cost= 0.6941, Validation ACC= 0.5229 (0.6927)
Epoch    11: Training cost= 0.6716, Training ACC= 0.5246, Validation cost= 0.6984, Validation ACC= 0.5260 (0.6933)
Epoch    12: Training cost= 0.6667, Training ACC= 0.5275, Validation cost= 0.6973, Validation ACC= 0.5290 (0.6937)
Epoch    13: Training cost= 0.6626, Training ACC= 0.5304, Validation cost= 0.6990, Validation ACC= 0.5316 (0.6943)
Epoch    14: Training cost= 0.6591, Training ACC= 0.5329, Validation cost= 0.7040, Validation ACC= 0.5340 (0.6954)
Epoch    15: Training cost= 0.6566, Training ACC= 0.5352, Validation cost= 0.7029, Validation ACC= 0.5362 (0.6965)
QNLI pmlp 64 10906870 38.5722 2.5715
