Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  2801300   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  4160      
_________________________________________________________________
dense_8 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,830,870
Trainable params: 2,830,870
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.8447, Training ACC= 0.4872, Validation cost= 0.6920, Validation ACC= 0.4965 (......)
Epoch     2: Training cost= 0.7143, Training ACC= 0.5028, Validation cost= 0.6915, Validation ACC= 0.5072 (......)
Epoch     3: Training cost= 0.7086, Training ACC= 0.5076, Validation cost= 0.6921, Validation ACC= 0.5063 (......)
Epoch     4: Training cost= 0.7047, Training ACC= 0.5048, Validation cost= 0.6925, Validation ACC= 0.5020 (......)
Epoch     5: Training cost= 0.6962, Training ACC= 0.5041, Validation cost= 0.6930, Validation ACC= 0.5045 (......)
Epoch     6: Training cost= 0.6967, Training ACC= 0.5051, Validation cost= 0.6929, Validation ACC= 0.5042 (......)
Epoch     7: Training cost= 0.6969, Training ACC= 0.5044, Validation cost= 0.6928, Validation ACC= 0.5047 (......)
Epoch     8: Training cost= 0.6968, Training ACC= 0.5045, Validation cost= 0.6928, Validation ACC= 0.5035 (......)
Epoch     9: Training cost= 0.6928, Training ACC= 0.5045, Validation cost= 0.6928, Validation ACC= 0.5053 (......)
Epoch    10: Training cost= 0.6968, Training ACC= 0.5055, Validation cost= 0.6927, Validation ACC= 0.5055 (0.6925)
Epoch    11: Training cost= 0.6948, Training ACC= 0.5062, Validation cost= 0.6926, Validation ACC= 0.5065 (0.6926)
Epoch    12: Training cost= 0.6950, Training ACC= 0.5059, Validation cost= 0.6926, Validation ACC= 0.5054 (0.6927)
Epoch    13: Training cost= 0.6958, Training ACC= 0.5046, Validation cost= 0.6923, Validation ACC= 0.5037 (0.6927)
Epoch    14: Training cost= 0.6957, Training ACC= 0.5030, Validation cost= 0.6926, Validation ACC= 0.5025 (0.6927)
Epoch    15: Training cost= 0.6956, Training ACC= 0.5019, Validation cost= 0.6925, Validation ACC= 0.5013 (0.6927)
RTE pmlp 64 2830870 1.6312 0.1087
