Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  21120     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  4160      
_________________________________________________________________
dense_7 (Dense)              multiple                  130       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,781,410
Trainable params: 1,781,410
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6733, Training ACC= 0.5530, Validation cost= 0.6704, Validation ACC= 0.5821 (......)
Epoch     2: Training cost= 0.6139, Training ACC= 0.6002, Validation cost= 0.6680, Validation ACC= 0.6136 (......)
Epoch     3: Training cost= 0.5843, Training ACC= 0.6229, Validation cost= 0.6673, Validation ACC= 0.6306 (......)
Epoch     4: Training cost= 0.5590, Training ACC= 0.6372, Validation cost= 0.6667, Validation ACC= 0.6429 (......)
Epoch     5: Training cost= 0.5429, Training ACC= 0.6478, Validation cost= 0.6947, Validation ACC= 0.6521 (......)
Epoch     6: Training cost= 0.5313, Training ACC= 0.6560, Validation cost= 0.6852, Validation ACC= 0.6594 (......)
Epoch     7: Training cost= 0.5210, Training ACC= 0.6624, Validation cost= 0.6904, Validation ACC= 0.6649 (......)
Epoch     8: Training cost= 0.5139, Training ACC= 0.6674, Validation cost= 0.7256, Validation ACC= 0.6694 (......)
Epoch     9: Training cost= 0.5093, Training ACC= 0.6715, Validation cost= 0.6941, Validation ACC= 0.6732 (......)
Epoch    10: Training cost= 0.5058, Training ACC= 0.6750, Validation cost= 0.7101, Validation ACC= 0.6763 (0.6873)
Epoch    11: Training cost= 0.5023, Training ACC= 0.6778, Validation cost= 0.7369, Validation ACC= 0.6789 (0.6939)
Epoch    12: Training cost= 0.4999, Training ACC= 0.6800, Validation cost= 0.7273, Validation ACC= 0.6811 (0.6998)
Epoch    13: Training cost= 0.4981, Training ACC= 0.6821, Validation cost= 0.7199, Validation ACC= 0.6830 (0.7051)
Epoch    14: Training cost= 0.4965, Training ACC= 0.6839, Validation cost= 0.7241, Validation ACC= 0.6847 (0.7108)
Epoch    15: Training cost= 0.4959, Training ACC= 0.6854, Validation cost= 0.7370, Validation ACC= 0.6861 (0.7151)
SST-2 pmlp 64 1781410 6.7742 0.4516
