Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,117,639
Trainable params: 11,117,639
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0939, Training ACC= 0.3467, Validation cost= 1.0878, Validation ACC= 0.3571 (......)
Epoch     2: Training cost= 1.0873, Training ACC= 0.3618, Validation cost= 1.0860, Validation ACC= 0.3651 (......)
Epoch     3: Training cost= 1.0849, Training ACC= 0.3677, Validation cost= 1.0831, Validation ACC= 0.3696 (......)
Epoch     4: Training cost= 1.0832, Training ACC= 0.3714, Validation cost= 1.0833, Validation ACC= 0.3726 (......)
Epoch     5: Training cost= 1.0816, Training ACC= 0.3742, Validation cost= 1.0835, Validation ACC= 0.3754 (......)
Epoch     6: Training cost= 1.0795, Training ACC= 0.3767, Validation cost= 1.0834, Validation ACC= 0.3777 (......)
Epoch     7: Training cost= 1.0774, Training ACC= 0.3790, Validation cost= 1.0848, Validation ACC= 0.3800 (......)
Epoch     8: Training cost= 1.0747, Training ACC= 0.3811, Validation cost= 1.0849, Validation ACC= 0.3820 (......)
Epoch     9: Training cost= 1.0719, Training ACC= 0.3830, Validation cost= 1.0868, Validation ACC= 0.3839 (......)
Epoch    10: Training cost= 1.0691, Training ACC= 0.3848, Validation cost= 1.0894, Validation ACC= 0.3856 (1.0853)
Epoch    11: Training cost= 1.0671, Training ACC= 0.3864, Validation cost= 1.0891, Validation ACC= 0.3871 (1.0854)
Epoch    12: Training cost= 1.0647, Training ACC= 0.3878, Validation cost= 1.0955, Validation ACC= 0.3884 (1.0864)
Epoch    13: Training cost= 1.0628, Training ACC= 0.3890, Validation cost= 1.0970, Validation ACC= 0.3896 (1.0878)
Epoch    14: Training cost= 1.0615, Training ACC= 0.3901, Validation cost= 1.0953, Validation ACC= 0.3905 (1.0890)
Epoch    15: Training cost= 1.0603, Training ACC= 0.3910, Validation cost= 1.0987, Validation ACC= 0.3915 (1.0905)
MNLI-mm pmlp 256 11117639 317.4254 21.1617
