Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  771       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,933,439
Trainable params: 10,933,439
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0947, Training ACC= 0.3485, Validation cost= 1.0875, Validation ACC= 0.3574 (......)
Epoch     2: Training cost= 1.0874, Training ACC= 0.3621, Validation cost= 1.0832, Validation ACC= 0.3652 (......)
Epoch     3: Training cost= 1.0848, Training ACC= 0.3676, Validation cost= 1.0827, Validation ACC= 0.3692 (......)
Epoch     4: Training cost= 1.0834, Training ACC= 0.3708, Validation cost= 1.0836, Validation ACC= 0.3723 (......)
Epoch     5: Training cost= 1.0819, Training ACC= 0.3737, Validation cost= 1.0828, Validation ACC= 0.3747 (......)
Epoch     6: Training cost= 1.0799, Training ACC= 0.3760, Validation cost= 1.0830, Validation ACC= 0.3771 (......)
Epoch     7: Training cost= 1.0780, Training ACC= 0.3784, Validation cost= 1.0826, Validation ACC= 0.3794 (......)
Epoch     8: Training cost= 1.0754, Training ACC= 0.3805, Validation cost= 1.0838, Validation ACC= 0.3813 (......)
Epoch     9: Training cost= 1.0726, Training ACC= 0.3823, Validation cost= 1.0848, Validation ACC= 0.3831 (......)
Epoch    10: Training cost= 1.0701, Training ACC= 0.3841, Validation cost= 1.0862, Validation ACC= 0.3849 (1.0840)
Epoch    11: Training cost= 1.0678, Training ACC= 0.3857, Validation cost= 1.0899, Validation ACC= 0.3864 (1.0843)
Epoch    12: Training cost= 1.0655, Training ACC= 0.3872, Validation cost= 1.0887, Validation ACC= 0.3878 (1.0848)
Epoch    13: Training cost= 1.0634, Training ACC= 0.3884, Validation cost= 1.0901, Validation ACC= 0.3889 (1.0856)
Epoch    14: Training cost= 1.0615, Training ACC= 0.3895, Validation cost= 1.0908, Validation ACC= 0.3900 (1.0863)
Epoch    15: Training cost= 1.0609, Training ACC= 0.3905, Validation cost= 1.0963, Validation ACC= 0.3909 (1.0876)
MNLI-m pmlp 256 10933439 316.0841 21.0723
