Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  65792     
_________________________________________________________________
dense_8 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 11,192,182
Trainable params: 11,192,182
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6938, Training ACC= 0.5078, Validation cost= 0.6926, Validation ACC= 0.5098 (......)
Epoch     2: Training cost= 0.6926, Training ACC= 0.5124, Validation cost= 0.6930, Validation ACC= 0.5139 (......)
Epoch     3: Training cost= 0.6914, Training ACC= 0.5156, Validation cost= 0.6925, Validation ACC= 0.5169 (......)
Epoch     4: Training cost= 0.6896, Training ACC= 0.5187, Validation cost= 0.6910, Validation ACC= 0.5203 (......)
Epoch     5: Training cost= 0.6847, Training ACC= 0.5227, Validation cost= 0.6916, Validation ACC= 0.5247 (......)
Epoch     6: Training cost= 0.6779, Training ACC= 0.5273, Validation cost= 0.6947, Validation ACC= 0.5294 (......)
Epoch     7: Training cost= 0.6706, Training ACC= 0.5317, Validation cost= 0.6952, Validation ACC= 0.5336 (......)
Epoch     8: Training cost= 0.6638, Training ACC= 0.5357, Validation cost= 0.6975, Validation ACC= 0.5374 (......)
Epoch     9: Training cost= 0.6587, Training ACC= 0.5391, Validation cost= 0.6965, Validation ACC= 0.5407 (......)
Epoch    10: Training cost= 0.6546, Training ACC= 0.5421, Validation cost= 0.7035, Validation ACC= 0.5434 (0.6948)
Epoch    11: Training cost= 0.6521, Training ACC= 0.5447, Validation cost= 0.7233, Validation ACC= 0.5458 (0.6979)
Epoch    12: Training cost= 0.6498, Training ACC= 0.5468, Validation cost= 0.7111, Validation ACC= 0.5476 (0.6997)
Epoch    13: Training cost= 0.6486, Training ACC= 0.5486, Validation cost= 0.7153, Validation ACC= 0.5494 (0.7020)
Epoch    14: Training cost= 0.6470, Training ACC= 0.5502, Validation cost= 0.7176, Validation ACC= 0.5510 (0.7046)
Epoch    15: Training cost= 0.6457, Training ACC= 0.5517, Validation cost= 0.7276, Validation ACC= 0.5522 (0.7082)
QNLI pmlp 256 11192182 87.1991 5.8133
