Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  182784    
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  65792     
_________________________________________________________________
dense_7 (Dense)              multiple                  514       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 2,005,090
Trainable params: 2,005,090
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6360, Training ACC= 0.5880, Validation cost= 0.6733, Validation ACC= 0.6178 (......)
Epoch     2: Training cost= 0.5847, Training ACC= 0.6303, Validation cost= 0.6725, Validation ACC= 0.6395 (......)
Epoch     3: Training cost= 0.5576, Training ACC= 0.6467, Validation cost= 0.6713, Validation ACC= 0.6522 (......)
Epoch     4: Training cost= 0.5380, Training ACC= 0.6572, Validation cost= 0.6914, Validation ACC= 0.6614 (......)
Epoch     5: Training cost= 0.5250, Training ACC= 0.6649, Validation cost= 0.6991, Validation ACC= 0.6681 (......)
Epoch     6: Training cost= 0.5143, Training ACC= 0.6712, Validation cost= 0.6977, Validation ACC= 0.6737 (......)
Epoch     7: Training cost= 0.5083, Training ACC= 0.6759, Validation cost= 0.7261, Validation ACC= 0.6778 (......)
Epoch     8: Training cost= 0.5039, Training ACC= 0.6796, Validation cost= 0.7568, Validation ACC= 0.6811 (......)
Epoch     9: Training cost= 0.5004, Training ACC= 0.6827, Validation cost= 0.7190, Validation ACC= 0.6839 (......)
Epoch    10: Training cost= 0.4989, Training ACC= 0.6852, Validation cost= 0.7373, Validation ACC= 0.6862 (0.7045)
Epoch    11: Training cost= 0.4962, Training ACC= 0.6872, Validation cost= 0.7833, Validation ACC= 0.6880 (0.7154)
Epoch    12: Training cost= 0.4952, Training ACC= 0.6888, Validation cost= 0.7509, Validation ACC= 0.6895 (0.7233)
Epoch    13: Training cost= 0.4941, Training ACC= 0.6902, Validation cost= 0.7557, Validation ACC= 0.6908 (0.7317)
Epoch    14: Training cost= 0.4930, Training ACC= 0.6915, Validation cost= 0.7554, Validation ACC= 0.6921 (0.7381)
Epoch    15: Training cost= 0.4937, Training ACC= 0.6926, Validation cost= 0.8100, Validation ACC= 0.6931 (0.7492)
SST-2 pmlp 256 2005090 10.8621 0.7241
