Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  608600    
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 680,154
Trainable params: 680,154
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6356, Training ACC= 0.6650, Validation cost= 0.6187, Validation ACC= 0.6928 (......)
Epoch     2: Training cost= 0.6101, Training ACC= 0.6964, Validation cost= 0.6159, Validation ACC= 0.6979 (......)
Epoch     3: Training cost= 0.6066, Training ACC= 0.6987, Validation cost= 0.6163, Validation ACC= 0.6997 (......)
Epoch     4: Training cost= 0.6053, Training ACC= 0.6994, Validation cost= 0.6143, Validation ACC= 0.7004 (......)
Epoch     5: Training cost= 0.6022, Training ACC= 0.7011, Validation cost= 0.6093, Validation ACC= 0.7010 (......)
Epoch     6: Training cost= 0.5972, Training ACC= 0.7010, Validation cost= 0.6099, Validation ACC= 0.7012 (......)
Epoch     7: Training cost= 0.5910, Training ACC= 0.7014, Validation cost= 0.6063, Validation ACC= 0.7015 (......)
Epoch     8: Training cost= 0.5866, Training ACC= 0.7018, Validation cost= 0.6044, Validation ACC= 0.7017 (......)
Epoch     9: Training cost= 0.5718, Training ACC= 0.7018, Validation cost= 0.6044, Validation ACC= 0.7018 (......)
Epoch    10: Training cost= 0.5539, Training ACC= 0.7018, Validation cost= 0.6172, Validation ACC= 0.7019 (0.6117)
Epoch    11: Training cost= 0.5365, Training ACC= 0.7019, Validation cost= 0.6357, Validation ACC= 0.7023 (0.6134)
Epoch    12: Training cost= 0.5170, Training ACC= 0.7027, Validation cost= 0.6313, Validation ACC= 0.7030 (0.6149)
Epoch    13: Training cost= 0.4974, Training ACC= 0.7039, Validation cost= 0.6639, Validation ACC= 0.7048 (0.6197)
Epoch    14: Training cost= 0.4714, Training ACC= 0.7061, Validation cost= 0.7382, Validation ACC= 0.7074 (0.6321)
Epoch    15: Training cost= 0.4527, Training ACC= 0.7090, Validation cost= 0.8629, Validation ACC= 0.7102 (0.6574)
CoLA linear 128 680154 1.8141 0.1209
