Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,706,495
Trainable params: 10,706,495
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0223, Training ACC= 0.3948, Validation cost= 0.9399, Validation ACC= 0.4530 (......)
Epoch     2: Training cost= 0.9291, Training ACC= 0.4807, Validation cost= 0.9031, Validation ACC= 0.5000 (......)
Epoch     3: Training cost= 0.8868, Training ACC= 0.5146, Validation cost= 0.8888, Validation ACC= 0.5261 (......)
Epoch     4: Training cost= 0.8480, Training ACC= 0.5365, Validation cost= 0.8887, Validation ACC= 0.5450 (......)
Epoch     5: Training cost= 0.8110, Training ACC= 0.5536, Validation cost= 0.8976, Validation ACC= 0.5606 (......)
Epoch     6: Training cost= 0.7773, Training ACC= 0.5680, Validation cost= 0.9198, Validation ACC= 0.5741 (......)
Epoch     7: Training cost= 0.7480, Training ACC= 0.5806, Validation cost= 0.9430, Validation ACC= 0.5860 (......)
Epoch     8: Training cost= 0.7196, Training ACC= 0.5918, Validation cost= 1.0048, Validation ACC= 0.5966 (......)
Epoch     9: Training cost= 0.6943, Training ACC= 0.6018, Validation cost= 0.9854, Validation ACC= 0.6062 (......)
Epoch    10: Training cost= 0.6717, Training ACC= 0.6109, Validation cost= 1.0187, Validation ACC= 0.6150 (0.9390)
Epoch    11: Training cost= 0.6500, Training ACC= 0.6194, Validation cost= 1.1069, Validation ACC= 0.6232 (0.9557)
Epoch    12: Training cost= 0.6298, Training ACC= 0.6272, Validation cost= 1.1201, Validation ACC= 0.6307 (0.9774)
Epoch    13: Training cost= 0.6117, Training ACC= 0.6345, Validation cost= 1.2272, Validation ACC= 0.6379 (1.0112)
Epoch    14: Training cost= 0.5962, Training ACC= 0.6414, Validation cost= 1.1796, Validation ACC= 0.6445 (1.0403)
Epoch    15: Training cost= 0.5799, Training ACC= 0.6479, Validation cost= 1.2970, Validation ACC= 0.6508 (1.0803)
MNLI-m linear 128 10706495 237.8973 15.8598
