Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,890,695
Trainable params: 10,890,695
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0160, Training ACC= 0.4056, Validation cost= 0.9252, Validation ACC= 0.4619 (......)
Epoch     2: Training cost= 0.9263, Training ACC= 0.4878, Validation cost= 0.8978, Validation ACC= 0.5057 (......)
Epoch     3: Training cost= 0.8859, Training ACC= 0.5193, Validation cost= 0.8910, Validation ACC= 0.5296 (......)
Epoch     4: Training cost= 0.8468, Training ACC= 0.5397, Validation cost= 0.8904, Validation ACC= 0.5480 (......)
Epoch     5: Training cost= 0.8103, Training ACC= 0.5564, Validation cost= 0.9038, Validation ACC= 0.5631 (......)
Epoch     6: Training cost= 0.7751, Training ACC= 0.5704, Validation cost= 0.9143, Validation ACC= 0.5764 (......)
Epoch     7: Training cost= 0.7453, Training ACC= 0.5827, Validation cost= 0.9428, Validation ACC= 0.5881 (......)
Epoch     8: Training cost= 0.7174, Training ACC= 0.5938, Validation cost= 0.9777, Validation ACC= 0.5985 (......)
Epoch     9: Training cost= 0.6916, Training ACC= 0.6037, Validation cost= 1.0071, Validation ACC= 0.6081 (......)
Epoch    10: Training cost= 0.6676, Training ACC= 0.6128, Validation cost= 1.0525, Validation ACC= 0.6169 (0.9403)
Epoch    11: Training cost= 0.6465, Training ACC= 0.6213, Validation cost= 1.1094, Validation ACC= 0.6250 (0.9587)
Epoch    12: Training cost= 0.6267, Training ACC= 0.6290, Validation cost= 1.0938, Validation ACC= 0.6325 (0.9783)
Epoch    13: Training cost= 0.6092, Training ACC= 0.6363, Validation cost= 1.1834, Validation ACC= 0.6395 (1.0075)
Epoch    14: Training cost= 0.5920, Training ACC= 0.6431, Validation cost= 1.2194, Validation ACC= 0.6462 (1.0404)
Epoch    15: Training cost= 0.5767, Training ACC= 0.6495, Validation cost= 1.2295, Validation ACC= 0.6525 (1.0730)
MNLI-mm linear 128 10890695 241.0744 16.0716
