Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,965,366
Trainable params: 10,965,366
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6889, Training ACC= 0.5142, Validation cost= 0.6589, Validation ACC= 0.5387 (......)
Epoch     2: Training cost= 0.6585, Training ACC= 0.5589, Validation cost= 0.6513, Validation ACC= 0.5736 (......)
Epoch     3: Training cost= 0.6316, Training ACC= 0.5851, Validation cost= 0.6499, Validation ACC= 0.5941 (......)
Epoch     4: Training cost= 0.5907, Training ACC= 0.6039, Validation cost= 0.6691, Validation ACC= 0.6117 (......)
Epoch     5: Training cost= 0.5423, Training ACC= 0.6213, Validation cost= 0.6964, Validation ACC= 0.6287 (......)
Epoch     6: Training cost= 0.4983, Training ACC= 0.6370, Validation cost= 0.7673, Validation ACC= 0.6437 (......)
Epoch     7: Training cost= 0.4605, Training ACC= 0.6510, Validation cost= 0.8757, Validation ACC= 0.6571 (......)
Epoch     8: Training cost= 0.4267, Training ACC= 0.6634, Validation cost= 1.1594, Validation ACC= 0.6687 (......)
Epoch     9: Training cost= 0.3966, Training ACC= 0.6745, Validation cost= 1.2961, Validation ACC= 0.6794 (......)
Epoch    10: Training cost= 0.3689, Training ACC= 0.6848, Validation cost= 1.7167, Validation ACC= 0.6894 (0.9141)
Epoch    11: Training cost= 0.3424, Training ACC= 0.6945, Validation cost= 1.6233, Validation ACC= 0.6991 (1.0105)
Epoch    12: Training cost= 0.3178, Training ACC= 0.7041, Validation cost= 2.4224, Validation ACC= 0.7086 (1.1876)
Epoch    13: Training cost= 0.2956, Training ACC= 0.7135, Validation cost= 2.7659, Validation ACC= 0.7178 (1.3992)
Epoch    14: Training cost= 0.2749, Training ACC= 0.7226, Validation cost= 2.1360, Validation ACC= 0.7268 (1.5459)
Epoch    15: Training cost= 0.2535, Training ACC= 0.7314, Validation cost= 2.6283, Validation ACC= 0.7355 (1.7391)
QNLI linear 128 10965366 67.0108 4.4674
