Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  16512     
_________________________________________________________________
dense_6 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,498,066
Trainable params: 21,498,066
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5540, Training ACC= 0.6678, Validation cost= 0.4946, Validation ACC= 0.7146 (......)
Epoch     2: Training cost= 0.4684, Training ACC= 0.7337, Validation cost= 0.4743, Validation ACC= 0.7461 (......)
Epoch     3: Training cost= 0.4291, Training ACC= 0.7556, Validation cost= 0.4802, Validation ACC= 0.7627 (......)
Epoch     4: Training cost= 0.3978, Training ACC= 0.7693, Validation cost= 0.4893, Validation ACC= 0.7743 (......)
Epoch     5: Training cost= 0.3709, Training ACC= 0.7794, Validation cost= 0.5175, Validation ACC= 0.7836 (......)
Epoch     6: Training cost= 0.3482, Training ACC= 0.7877, Validation cost= 0.5373, Validation ACC= 0.7912 (......)
Epoch     7: Training cost= 0.3268, Training ACC= 0.7949, Validation cost= 0.6777, Validation ACC= 0.7980 (......)
Epoch     8: Training cost= 0.3090, Training ACC= 0.8013, Validation cost= 0.6957, Validation ACC= 0.8042 (......)
Epoch     9: Training cost= 0.2932, Training ACC= 0.8072, Validation cost= 0.8048, Validation ACC= 0.8097 (......)
Epoch    10: Training cost= 0.2801, Training ACC= 0.8124, Validation cost= 0.8114, Validation ACC= 0.8147 (0.5983)
Epoch    11: Training cost= 0.2678, Training ACC= 0.8171, Validation cost= 0.9070, Validation ACC= 0.8193 (0.6395)
Epoch    12: Training cost= 0.2573, Training ACC= 0.8215, Validation cost= 1.0664, Validation ACC= 0.8235 (0.6987)
Epoch    13: Training cost= 0.2473, Training ACC= 0.8255, Validation cost= 1.1850, Validation ACC= 0.8274 (0.7692)
Epoch    14: Training cost= 0.2377, Training ACC= 0.8293, Validation cost= 1.2471, Validation ACC= 0.8310 (0.8450)
Epoch    15: Training cost= 0.2302, Training ACC= 0.8328, Validation cost= 1.2655, Validation ACC= 0.8344 (0.9198)
QQP linear 128 21498066 229.8533 15.3236
