Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
linear_attention (LinearAtte multiple                  54784     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_4 (Dense)              multiple                  16512     
_________________________________________________________________
dense_5 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,827,554
Trainable params: 1,827,554
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.4952, Training ACC= 0.6352, Validation cost= 0.4310, Validation ACC= 0.7404 (......)
Epoch     2: Training cost= 0.2827, Training ACC= 0.7836, Validation cost= 0.4268, Validation ACC= 0.8128 (......)
Epoch     3: Training cost= 0.2169, Training ACC= 0.8320, Validation cost= 0.5143, Validation ACC= 0.8469 (......)
Epoch     4: Training cost= 0.1787, Training ACC= 0.8583, Validation cost= 0.5342, Validation ACC= 0.8677 (......)
Epoch     5: Training cost= 0.1555, Training ACC= 0.8756, Validation cost= 0.5415, Validation ACC= 0.8821 (......)
Epoch     6: Training cost= 0.1361, Training ACC= 0.8880, Validation cost= 0.6743, Validation ACC= 0.8929 (......)
Epoch     7: Training cost= 0.1218, Training ACC= 0.8975, Validation cost= 0.7459, Validation ACC= 0.9014 (......)
Epoch     8: Training cost= 0.1112, Training ACC= 0.9050, Validation cost= 0.8632, Validation ACC= 0.9082 (......)
Epoch     9: Training cost= 0.1025, Training ACC= 0.9112, Validation cost= 0.8992, Validation ACC= 0.9138 (......)
Epoch    10: Training cost= 0.0938, Training ACC= 0.9164, Validation cost= 0.8571, Validation ACC= 0.9186 (0.6487)
Epoch    11: Training cost= 0.0863, Training ACC= 0.9208, Validation cost= 1.0255, Validation ACC= 0.9228 (0.7082)
Epoch    12: Training cost= 0.0794, Training ACC= 0.9248, Validation cost= 1.2263, Validation ACC= 0.9265 (0.7882)
Epoch    13: Training cost= 0.0748, Training ACC= 0.9282, Validation cost= 1.1449, Validation ACC= 0.9297 (0.8512)
Epoch    14: Training cost= 0.0701, Training ACC= 0.9312, Validation cost= 1.3961, Validation ACC= 0.9325 (0.9374)
Epoch    15: Training cost= 0.0652, Training ACC= 0.9339, Validation cost= 1.5394, Validation ACC= 0.9352 (1.0372)
SST-2 linear 128 1827554 8.4530 0.5635
