Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,710,335
Trainable params: 10,710,335
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0404, Training ACC= 0.3903, Validation cost= 0.9682, Validation ACC= 0.4407 (......)
Epoch     2: Training cost= 0.9562, Training ACC= 0.4673, Validation cost= 0.9252, Validation ACC= 0.4861 (......)
Epoch     3: Training cost= 0.9166, Training ACC= 0.5003, Validation cost= 0.9141, Validation ACC= 0.5112 (......)
Epoch     4: Training cost= 0.8886, Training ACC= 0.5205, Validation cost= 0.9082, Validation ACC= 0.5281 (......)
Epoch     5: Training cost= 0.8662, Training ACC= 0.5351, Validation cost= 0.9040, Validation ACC= 0.5409 (......)
Epoch     6: Training cost= 0.8460, Training ACC= 0.5466, Validation cost= 0.9082, Validation ACC= 0.5512 (......)
Epoch     7: Training cost= 0.8278, Training ACC= 0.5560, Validation cost= 0.9208, Validation ACC= 0.5600 (......)
Epoch     8: Training cost= 0.8110, Training ACC= 0.5641, Validation cost= 0.9477, Validation ACC= 0.5677 (......)
Epoch     9: Training cost= 0.7966, Training ACC= 0.5714, Validation cost= 0.9313, Validation ACC= 0.5745 (......)
Epoch    10: Training cost= 0.7814, Training ACC= 0.5779, Validation cost= 0.9575, Validation ACC= 0.5808 (0.9285)
Epoch    11: Training cost= 0.7676, Training ACC= 0.5839, Validation cost= 0.9845, Validation ACC= 0.5865 (0.9302)
Epoch    12: Training cost= 0.7560, Training ACC= 0.5893, Validation cost= 0.9650, Validation ACC= 0.5917 (0.9341)
Epoch    13: Training cost= 0.7442, Training ACC= 0.5944, Validation cost= 1.0248, Validation ACC= 0.5966 (0.9452)
Epoch    14: Training cost= 0.7325, Training ACC= 0.5991, Validation cost= 1.0268, Validation ACC= 0.6013 (0.9571)
Epoch    15: Training cost= 0.7225, Training ACC= 0.6037, Validation cost= 1.0112, Validation ACC= 0.6058 (0.9678)
MNLI-m relation 128 10710335 180.7977 12.0532
