Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,894,535
Trainable params: 10,894,535
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0411, Training ACC= 0.3910, Validation cost= 0.9614, Validation ACC= 0.4411 (......)
Epoch     2: Training cost= 0.9549, Training ACC= 0.4680, Validation cost= 0.9282, Validation ACC= 0.4872 (......)
Epoch     3: Training cost= 0.9147, Training ACC= 0.5016, Validation cost= 0.9112, Validation ACC= 0.5124 (......)
Epoch     4: Training cost= 0.8870, Training ACC= 0.5217, Validation cost= 0.9043, Validation ACC= 0.5292 (......)
Epoch     5: Training cost= 0.8645, Training ACC= 0.5363, Validation cost= 0.9100, Validation ACC= 0.5419 (......)
Epoch     6: Training cost= 0.8451, Training ACC= 0.5475, Validation cost= 0.9091, Validation ACC= 0.5521 (......)
Epoch     7: Training cost= 0.8270, Training ACC= 0.5569, Validation cost= 0.9152, Validation ACC= 0.5609 (......)
Epoch     8: Training cost= 0.8102, Training ACC= 0.5651, Validation cost= 0.9278, Validation ACC= 0.5686 (......)
Epoch     9: Training cost= 0.7960, Training ACC= 0.5723, Validation cost= 0.9279, Validation ACC= 0.5754 (......)
Epoch    10: Training cost= 0.7817, Training ACC= 0.5788, Validation cost= 0.9387, Validation ACC= 0.5816 (0.9234)
Epoch    11: Training cost= 0.7686, Training ACC= 0.5847, Validation cost= 0.9586, Validation ACC= 0.5873 (0.9231)
Epoch    12: Training cost= 0.7548, Training ACC= 0.5902, Validation cost= 0.9970, Validation ACC= 0.5927 (0.9300)
Epoch    13: Training cost= 0.7421, Training ACC= 0.5955, Validation cost= 0.9668, Validation ACC= 0.5979 (0.9355)
Epoch    14: Training cost= 0.7306, Training ACC= 0.6004, Validation cost= 0.9724, Validation ACC= 0.6027 (0.9423)
Epoch    15: Training cost= 0.7187, Training ACC= 0.6051, Validation cost= 1.0140, Validation ACC= 0.6073 (0.9527)
Epoch    16: Training cost= 0.7087, Training ACC= 0.6096, Validation cost= 0.9911, Validation ACC= 0.6116 (0.9609)
MNLI-mm relation 128 10894535 196.7781 12.2986
