Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,969,206
Trainable params: 10,969,206
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6849, Training ACC= 0.5185, Validation cost= 0.6623, Validation ACC= 0.5482 (......)
Epoch     2: Training cost= 0.6598, Training ACC= 0.5658, Validation cost= 0.6562, Validation ACC= 0.5779 (......)
Epoch     3: Training cost= 0.6415, Training ACC= 0.5872, Validation cost= 0.6480, Validation ACC= 0.5942 (......)
Epoch     4: Training cost= 0.6205, Training ACC= 0.6012, Validation cost= 0.6452, Validation ACC= 0.6068 (......)
Epoch     5: Training cost= 0.5929, Training ACC= 0.6133, Validation cost= 0.6535, Validation ACC= 0.6186 (......)
Epoch     6: Training cost= 0.5620, Training ACC= 0.6248, Validation cost= 0.6805, Validation ACC= 0.6299 (......)
Epoch     7: Training cost= 0.5320, Training ACC= 0.6357, Validation cost= 0.7002, Validation ACC= 0.6405 (......)
Epoch     8: Training cost= 0.5046, Training ACC= 0.6457, Validation cost= 0.7275, Validation ACC= 0.6500 (......)
Epoch     9: Training cost= 0.4805, Training ACC= 0.6547, Validation cost= 0.7869, Validation ACC= 0.6584 (......)
Epoch    10: Training cost= 0.4593, Training ACC= 0.6624, Validation cost= 0.8207, Validation ACC= 0.6659 (0.6981)
Epoch    11: Training cost= 0.4371, Training ACC= 0.6697, Validation cost= 0.9154, Validation ACC= 0.6729 (0.7234)
Epoch    12: Training cost= 0.4196, Training ACC= 0.6766, Validation cost= 0.9289, Validation ACC= 0.6798 (0.7507)
Epoch    13: Training cost= 0.4035, Training ACC= 0.6833, Validation cost= 1.0976, Validation ACC= 0.6863 (0.7956)
Epoch    14: Training cost= 0.3835, Training ACC= 0.6897, Validation cost= 1.1415, Validation ACC= 0.6927 (0.8453)
Epoch    15: Training cost= 0.3688, Training ACC= 0.6961, Validation cost= 1.4238, Validation ACC= 0.6991 (0.9223)
QNLI relation 128 10969206 52.8235 3.5216
