Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  21410000  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 21,501,906
Trainable params: 21,501,906
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5587, Training ACC= 0.6731, Validation cost= 0.5112, Validation ACC= 0.7147 (......)
Epoch     2: Training cost= 0.4893, Training ACC= 0.7298, Validation cost= 0.4866, Validation ACC= 0.7399 (......)
Epoch     3: Training cost= 0.4608, Training ACC= 0.7472, Validation cost= 0.4812, Validation ACC= 0.7531 (......)
Epoch     4: Training cost= 0.4381, Training ACC= 0.7582, Validation cost= 0.4694, Validation ACC= 0.7622 (......)
Epoch     5: Training cost= 0.4204, Training ACC= 0.7660, Validation cost= 0.4714, Validation ACC= 0.7692 (......)
Epoch     6: Training cost= 0.4050, Training ACC= 0.7723, Validation cost= 0.4811, Validation ACC= 0.7749 (......)
Epoch     7: Training cost= 0.3908, Training ACC= 0.7774, Validation cost= 0.5056, Validation ACC= 0.7796 (......)
Epoch     8: Training cost= 0.3781, Training ACC= 0.7818, Validation cost= 0.4886, Validation ACC= 0.7837 (......)
Epoch     9: Training cost= 0.3676, Training ACC= 0.7857, Validation cost= 0.5209, Validation ACC= 0.7874 (......)
Epoch    10: Training cost= 0.3574, Training ACC= 0.7892, Validation cost= 0.5152, Validation ACC= 0.7907 (0.4931)
Epoch    11: Training cost= 0.3485, Training ACC= 0.7924, Validation cost= 0.5303, Validation ACC= 0.7939 (0.4950)
Epoch    12: Training cost= 0.3394, Training ACC= 0.7955, Validation cost= 0.5278, Validation ACC= 0.7968 (0.4992)
Epoch    13: Training cost= 0.3341, Training ACC= 0.7983, Validation cost= 0.6163, Validation ACC= 0.7995 (0.5127)
Epoch    14: Training cost= 0.3261, Training ACC= 0.8008, Validation cost= 0.5945, Validation ACC= 0.8020 (0.5252)
Epoch    15: Training cost= 0.3191, Training ACC= 0.8033, Validation cost= 0.5749, Validation ACC= 0.8045 (0.5355)
QQP relation 128 21501906 179.5254 11.9684
