Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
relation (Relation)          multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,831,394
Trainable params: 1,831,394
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.5250, Training ACC= 0.6386, Validation cost= 0.4415, Validation ACC= 0.7255 (......)
Epoch     2: Training cost= 0.3350, Training ACC= 0.7656, Validation cost= 0.4154, Validation ACC= 0.7944 (......)
Epoch     3: Training cost= 0.2593, Training ACC= 0.8140, Validation cost= 0.4171, Validation ACC= 0.8292 (......)
Epoch     4: Training cost= 0.2165, Training ACC= 0.8411, Validation cost= 0.4104, Validation ACC= 0.8510 (......)
Epoch     5: Training cost= 0.1925, Training ACC= 0.8591, Validation cost= 0.4579, Validation ACC= 0.8660 (......)
Epoch     6: Training cost= 0.1680, Training ACC= 0.8723, Validation cost= 0.4921, Validation ACC= 0.8775 (......)
Epoch     7: Training cost= 0.1548, Training ACC= 0.8824, Validation cost= 0.4818, Validation ACC= 0.8865 (......)
Epoch     8: Training cost= 0.1445, Training ACC= 0.8902, Validation cost= 0.5202, Validation ACC= 0.8936 (......)
Epoch     9: Training cost= 0.1331, Training ACC= 0.8967, Validation cost= 0.5475, Validation ACC= 0.8995 (......)
Epoch    10: Training cost= 0.1252, Training ACC= 0.9022, Validation cost= 0.4974, Validation ACC= 0.9045 (0.4681)
Epoch    11: Training cost= 0.1176, Training ACC= 0.9069, Validation cost= 0.5803, Validation ACC= 0.9089 (0.4820)
Epoch    12: Training cost= 0.1116, Training ACC= 0.9110, Validation cost= 0.6143, Validation ACC= 0.9127 (0.5019)
Epoch    13: Training cost= 0.1046, Training ACC= 0.9146, Validation cost= 0.6237, Validation ACC= 0.9162 (0.5226)
Epoch    14: Training cost= 0.0978, Training ACC= 0.9178, Validation cost= 0.7104, Validation ACC= 0.9192 (0.5526)
Epoch    15: Training cost= 0.0939, Training ACC= 0.9207, Validation cost= 0.7308, Validation ACC= 0.9219 (0.5799)
SST-2 relation 128 1831394 6.8008 0.4534
