Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10618300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,710,335
Trainable params: 10,710,335
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0967, Training ACC= 0.3423, Validation cost= 1.0877, Validation ACC= 0.3500 (......)
Epoch     2: Training cost= 1.0882, Training ACC= 0.3561, Validation cost= 1.0826, Validation ACC= 0.3604 (......)
Epoch     3: Training cost= 1.0850, Training ACC= 0.3639, Validation cost= 1.0838, Validation ACC= 0.3664 (......)
Epoch     4: Training cost= 1.0826, Training ACC= 0.3688, Validation cost= 1.0809, Validation ACC= 0.3708 (......)
Epoch     5: Training cost= 1.0813, Training ACC= 0.3725, Validation cost= 1.0809, Validation ACC= 0.3739 (......)
Epoch     6: Training cost= 1.0789, Training ACC= 0.3753, Validation cost= 1.0814, Validation ACC= 0.3766 (......)
Epoch     7: Training cost= 1.0765, Training ACC= 0.3779, Validation cost= 1.0821, Validation ACC= 0.3790 (......)
Epoch     8: Training cost= 1.0736, Training ACC= 0.3803, Validation cost= 1.0842, Validation ACC= 0.3814 (......)
Epoch     9: Training cost= 1.0712, Training ACC= 0.3825, Validation cost= 1.0856, Validation ACC= 0.3835 (......)
Epoch    10: Training cost= 1.0678, Training ACC= 0.3845, Validation cost= 1.0866, Validation ACC= 0.3854 (1.0836)
Epoch    11: Training cost= 1.0656, Training ACC= 0.3864, Validation cost= 1.0894, Validation ACC= 0.3871 (1.0837)
Epoch    12: Training cost= 1.0628, Training ACC= 0.3879, Validation cost= 1.0877, Validation ACC= 0.3886 (1.0843)
Epoch    13: Training cost= 1.0609, Training ACC= 0.3894, Validation cost= 1.0890, Validation ACC= 0.3900 (1.0848)
Epoch    14: Training cost= 1.0592, Training ACC= 0.3907, Validation cost= 1.0921, Validation ACC= 0.3912 (1.0859)
Epoch    15: Training cost= 1.0574, Training ACC= 0.3918, Validation cost= 1.0995, Validation ACC= 0.3923 (1.0878)
MNLI-m pmlp 128 10710335 181.3495 12.0900
