Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10802500  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  387       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,894,535
Trainable params: 10,894,535
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 1.0964, Training ACC= 0.3425, Validation cost= 1.0880, Validation ACC= 0.3513 (......)
Epoch     2: Training cost= 1.0878, Training ACC= 0.3577, Validation cost= 1.0828, Validation ACC= 0.3619 (......)
Epoch     3: Training cost= 1.0846, Training ACC= 0.3651, Validation cost= 1.0827, Validation ACC= 0.3678 (......)
Epoch     4: Training cost= 1.0824, Training ACC= 0.3701, Validation cost= 1.0802, Validation ACC= 0.3718 (......)
Epoch     5: Training cost= 1.0805, Training ACC= 0.3737, Validation cost= 1.0814, Validation ACC= 0.3751 (......)
Epoch     6: Training cost= 1.0782, Training ACC= 0.3767, Validation cost= 1.0831, Validation ACC= 0.3780 (......)
Epoch     7: Training cost= 1.0755, Training ACC= 0.3794, Validation cost= 1.0830, Validation ACC= 0.3805 (......)
Epoch     8: Training cost= 1.0726, Training ACC= 0.3818, Validation cost= 1.0854, Validation ACC= 0.3828 (......)
Epoch     9: Training cost= 1.0698, Training ACC= 0.3840, Validation cost= 1.0862, Validation ACC= 0.3850 (......)
Epoch    10: Training cost= 1.0666, Training ACC= 0.3860, Validation cost= 1.0898, Validation ACC= 0.3868 (1.0843)
Epoch    11: Training cost= 1.0639, Training ACC= 0.3878, Validation cost= 1.0922, Validation ACC= 0.3885 (1.0847)
Epoch    12: Training cost= 1.0615, Training ACC= 0.3893, Validation cost= 1.1011, Validation ACC= 0.3900 (1.0865)
Epoch    13: Training cost= 1.0599, Training ACC= 0.3906, Validation cost= 1.1048, Validation ACC= 0.3912 (1.0887)
Epoch    14: Training cost= 1.0582, Training ACC= 0.3918, Validation cost= 1.1041, Validation ACC= 0.3923 (1.0911)
Epoch    15: Training cost= 1.0561, Training ACC= 0.3929, Validation cost= 1.1121, Validation ACC= 0.3934 (1.0942)
MNLI-mm pmlp 128 10894535 183.9366 12.2624
