Model: "co_l_ad"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  10877300  
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  16512     
_________________________________________________________________
dense_8 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 10,969,206
Trainable params: 10,969,206
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6946, Training ACC= 0.5065, Validation cost= 0.6932, Validation ACC= 0.5050 (......)
Epoch     2: Training cost= 0.6932, Training ACC= 0.5063, Validation cost= 0.6929, Validation ACC= 0.5073 (......)
Epoch     3: Training cost= 0.6922, Training ACC= 0.5092, Validation cost= 0.6920, Validation ACC= 0.5111 (......)
Epoch     4: Training cost= 0.6910, Training ACC= 0.5134, Validation cost= 0.6915, Validation ACC= 0.5152 (......)
Epoch     5: Training cost= 0.6888, Training ACC= 0.5171, Validation cost= 0.6921, Validation ACC= 0.5190 (......)
Epoch     6: Training cost= 0.6847, Training ACC= 0.5212, Validation cost= 0.6937, Validation ACC= 0.5233 (......)
Epoch     7: Training cost= 0.6778, Training ACC= 0.5256, Validation cost= 0.6942, Validation ACC= 0.5276 (......)
Epoch     8: Training cost= 0.6707, Training ACC= 0.5296, Validation cost= 0.6977, Validation ACC= 0.5314 (......)
Epoch     9: Training cost= 0.6642, Training ACC= 0.5334, Validation cost= 0.7006, Validation ACC= 0.5351 (......)
Epoch    10: Training cost= 0.6592, Training ACC= 0.5367, Validation cost= 0.7041, Validation ACC= 0.5380 (0.6952)
Epoch    11: Training cost= 0.6557, Training ACC= 0.5395, Validation cost= 0.7109, Validation ACC= 0.5407 (0.6970)
Epoch    12: Training cost= 0.6525, Training ACC= 0.5419, Validation cost= 0.7107, Validation ACC= 0.5431 (0.6987)
Epoch    13: Training cost= 0.6501, Training ACC= 0.5441, Validation cost= 0.7122, Validation ACC= 0.5450 (0.7008)
Epoch    14: Training cost= 0.6488, Training ACC= 0.5460, Validation cost= 0.7149, Validation ACC= 0.5468 (0.7031)
Epoch    15: Training cost= 0.6468, Training ACC= 0.5477, Validation cost= 0.7247, Validation ACC= 0.5485 (0.7064)
QNLI pmlp 128 10969206 50.8560 3.3904
