Model: "co_la"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pmlp (Pmlp)                  multiple                  58624     
_________________________________________________________________
embedding (Embedding)        multiple                  1756000   
_________________________________________________________________
positional_encoder (Position multiple                  0         
_________________________________________________________________
attention_mask_label_seq (At multiple                  0         
_________________________________________________________________
dense_6 (Dense)              multiple                  16512     
_________________________________________________________________
dense_7 (Dense)              multiple                  258       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 1,831,394
Trainable params: 1,831,394
Non-trainable params: 0
_________________________________________________________________
Epoch     1: Training cost= 0.6480, Training ACC= 0.5737, Validation cost= 0.6690, Validation ACC= 0.6059 (......)
Epoch     2: Training cost= 0.5953, Training ACC= 0.6212, Validation cost= 0.6672, Validation ACC= 0.6318 (......)
Epoch     3: Training cost= 0.5676, Training ACC= 0.6399, Validation cost= 0.6729, Validation ACC= 0.6460 (......)
Epoch     4: Training cost= 0.5469, Training ACC= 0.6515, Validation cost= 0.6778, Validation ACC= 0.6563 (......)
Epoch     5: Training cost= 0.5327, Training ACC= 0.6600, Validation cost= 0.7133, Validation ACC= 0.6634 (......)
Epoch     6: Training cost= 0.5207, Training ACC= 0.6667, Validation cost= 0.6845, Validation ACC= 0.6694 (......)
Epoch     7: Training cost= 0.5134, Training ACC= 0.6719, Validation cost= 0.7061, Validation ACC= 0.6740 (......)
Epoch     8: Training cost= 0.5083, Training ACC= 0.6760, Validation cost= 0.7494, Validation ACC= 0.6777 (......)
Epoch     9: Training cost= 0.5042, Training ACC= 0.6793, Validation cost= 0.7035, Validation ACC= 0.6806 (......)
Epoch    10: Training cost= 0.5014, Training ACC= 0.6819, Validation cost= 0.7417, Validation ACC= 0.6829 (0.6985)
Epoch    11: Training cost= 0.4993, Training ACC= 0.6842, Validation cost= 0.7543, Validation ACC= 0.6851 (0.7071)
Epoch    12: Training cost= 0.4969, Training ACC= 0.6861, Validation cost= 0.7291, Validation ACC= 0.6870 (0.7133)
Epoch    13: Training cost= 0.4959, Training ACC= 0.6878, Validation cost= 0.7442, Validation ACC= 0.6885 (0.7204)
Epoch    14: Training cost= 0.4951, Training ACC= 0.6892, Validation cost= 0.7318, Validation ACC= 0.6898 (0.7258)
Epoch    15: Training cost= 0.4938, Training ACC= 0.6904, Validation cost= 0.7738, Validation ACC= 0.6910 (0.7318)
SST-2 pmlp 128 1831394 6.8019 0.4535
